





AAA Working Group                                         Pat R. Calhoun
Internet-Draft                                     Sun Microsystems, Inc.
Category: Standards Track                                  Haseeb Akhtar
<draft-ietf-aaa-diameter-05.txt>                         Nortel Networks
                                                              Jari Arkko
                                                       Oy LM Ericsson Ab
                                                            Erik Guttman
                                                  Sun Microsystems, Inc.
                                                         Allan C. Rubens
                                                       Tut Systems, Inc.
                                                               Glen Zorn
                                                     Cisco Systems, Inc.
                                                               June 2001



                         Diameter Base Protocol



Status of this Memo

   This document is an Internet-Draft and is in full conformance with
   all provisions of Section 10 of RFC2026.  Internet-Drafts are working
   documents of the Internet Engineering Task Force (IETF), its areas,
   and its working groups.  Note that other groups may also distribute
   working documents as Internet-Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at:

      http://www.ietf.org/ietf/1id-abstracts.txt

   The list of Internet-Draft Shadow Directories can be accessed at:

      http://www.ietf.org/shadow.html.

   Distribution of this memo is unlimited.

   Copyright   (C) The Internet Society 2001.  All Rights Reserved.







Calhoun et al.           expires December 2001                  [Page 1]





Internet-Draft                                                 June 2001


Abstract

   The Diameter base protocol is intended to provide a AAA framework for
   Mobile-IP, NASREQ and ROAMOPS. This draft specifies the message
   format, transport, error reporting and security services to be used
   by all Diameter applications and MUST be supported by all Diameter
   implementations.


Table of Contents

      1.0  Introduction
            1.1  Diameter Protocol
            1.2  Requirements language
            1.3  Terminology
      2.0  Protocol Overview
            2.1  Transport
                  2.1.1  SCTP Guidelines
            2.2  Securing Diameter Messages
            2.3  Diameter Protocol Extensibility
                  2.3.1  Defining new AVP Values
                  2.3.2  Creating new AVPs
                  2.3.3  Creating a new Diameter Applications
                  2.3.4  Application authentication procedures
            2.4  Diameter Applications
            2.5  Role of Diameter Agents
                  2.5.1  Relay Agents
                  2.5.2  Proxy Agents
                  2.5.3  Redirector Agents
                  2.5.4  Translation Agents
            2.6  Diameter Server Discovery
            2.7  Diameter Identity Encoding
      3.0  Diameter Header
            3.1  Command Code Definitions
            3.2  Command Code ABNF specification
            3.3  Diameter Command Naming Conventions
      4.0  Diameter AVPs
                  4.1  AVP Header
                  4.2  Optional Header Elements
                  4.3  AVP Data Formats
                  4.4  Grouped AVP Values
                     4.4.1  Example AVP with a Grouped Data type
                  4.5  Diameter Base Protocol AVPs
      5.0  Diameter message processing
            5.1  Processing Local Messages
            5.2  Message Forwarding
                  5.2.1  Peer Table
            5.3  Message Routing



Calhoun et al.           expires December 2001                  [Page 2]





Internet-Draft                                                 June 2001


                  5.3.1  Realm-Based Routing Table
                  5.3.2  Redirecting requests
                  5.3.3  Relaying and Proxying Requests
                  5.3.4  Relaying and Proxying Answers
                  5.3.5  Hiding Network Topology
            5.4  Origin-Host AVP
            5.5  Origin-Realm AVP
            5.6  Destination-Host AVP
            5.7  Destination-Realm AVP
            5.8  Routing AVPs
                  5.8.1  Route-Record AVP
                  5.8.2  Proxy-Info AVP
                  5.8.3  Proxy-Host AVP
                  5.8.4  Proxy-State AVP
            5.9  Redirect-Host AVP
      6.0  Capabilities Negotiation
            6.1  Application Identifiers
            6.2  Capabilities-Exchange-Request
            6.3  Capabilities-Exchange-Answer
                  6.4  Vendor-Id AVP
                  6.5  Firmware-Revision AVP
                  6.6  Auth-Application-Id AVP
                  6.7  Host-IP-Address AVP
                  6.8  Supported-Vendor-Id AVP
                  6.9  Product-Name AVP
                  6.10 Acct-Application-Id AVP
                  6.11 Vendor-Specific-Application-Id AVP
      7.0  Transport Failure Detection
            7.1  Device-Watchdog-Request
            7.2  Device-Watchdog-Answer
            7.3  Failover/Failback Procedures
      8.0  Peer State Machine
            8.1  States
            8.2  Events
            8.3  Actions
            8.4  The Election Process
      9.0  Error Handling
            9.1  Result-Code AVP
                  9.1.1  Informational
                  9.1.2  Success
                  9.1.3  Protocol Errors
                  9.1.4  Transient Failures
                  9.1.5  Permanent Failures
      9.2  Message-Reject-Answer
      9.3  Error-Message AVP
      9.4  Error-Reporting-Host AVP
      9.5  Failed-AVP AVP
      10.0  "User" Sessions



Calhoun et al.           expires December 2001                  [Page 3]





Internet-Draft                                                 June 2001


            10.1  Authorization Session State Machine
            10.2  Accounting Session State Machine
            10.3  Session-Id AVP
            10.4  Authorization-Lifetime AVP
            10.5  Session-Timeout AVP
            10.6  User-Name AVP
            10.7  Session Termination
                  10.7.1  Session-Termination-Request
                  10.7.2  Session-Termination-Answer
      10.8  Aborting a Session
            10.8.1  Abort-Session-Request
            10.8.2  Abort-Session-Answer
            10.9  Termination-Cause AVP
            10.10 Inferring Session Termination from Origin-State-Id
            10.11 Origin-State-Id AVP
      11.0  Accounting
            11.1  Server Directed Model
            11.2  Protocol Messages
            11.3  Application document requirements
            11.4  Fault Resilience
            11.5  Accounting Records
      12.0  Accounting Command-Codes
            12.1  Accounting-Request
            12.2  Accounting-Answer
            12.3  Accounting-Poll-Ind
      13.0 Accounting AVPs
            13.1  Accounting-Record-Type AVP
            13.2  Accounting-Interim-Interval AVP
            13.3  Accounting-Record-Number AVP
            13.4  Accounting-Session-Id AVP
            13.5  Accounting-Multi-Session-Id AVP
      14.0  AVP Occurrence Table
            14.1  Base Protocol Command AVP Table
            14.2  Accounting AVP Table
      15.0  IANA Considerations
            15.1  AVP Header
                  15.1.1  AVP Code
                  15.1.2  AVP Flags
            15.2  Diameter Header
                  15.2.1  Command Codes
                  15.2.2  Message Flags
            15.3  Application Identifier Values
            15.4  Result-Code AVP Values
            15.5  Accounting-Record-Type AVP Values
            15.6  Termination-Cause AVP Values
            15.7  Diameter TCP/SCTP Port Numbers
      16.0  Diameter protocol related configurable parameters
      17.0  Security Considerations



Calhoun et al.           expires December 2001                  [Page 4]





Internet-Draft                                                 June 2001


      18.0  References
      19.0  Acknowledgements
      20.0  Authors' Addresses
      21.0  Full Copyright Statement
      22.0  Expiration Date
      Appendix A. Diameter Service Template













































Calhoun et al.           expires December 2001                  [Page 5]





Internet-Draft                                                 June 2001


1.0  Introduction

   Historically, the RADIUS protocol has been used to provide AAA
   services for dial-up PPP [42] and terminal server access. Over time,
   routers and network access servers (NAS) have increased in complexity
   and density, making the RADIUS protocol increasingly unsuitable for
   use in such networks.

   The Roaming Operations Working Group (ROAMOPS) has published a set of
   specifications [20, 43, 44] that define how a PPP user can gain
   access to the Internet without having to dial into his/her home
   service provider's modem pool. This is achieved by allowing service
   providers to cross-authenticate their users. Effectively, a user can
   dial into any service provider's point of presence (POP) that has a
   roaming agreement with his/her home Internet service provider (ISP),
   the benefit being that the user does not have to incur a long
   distance charge while traveling, which can sometimes be quite
   expensive.

   Given the number of ISPs today, ROAMOPS realized that requiring each
   ISP to set up roaming agreements with all other ISPs did not scale.
   Therefore, the working group defined a "broker", which acts as an
   intermediate server, whose sole purpose is to set up these roaming
   agreements. A collection of ISPs and a broker is called a "roaming
   consortium". There are many such brokers in existence today; many
   also provide settlement services for member ISPs.

   The Mobile-IP Working Group has recently changed its focus to inter
   administrative domain mobility, which is a requirement for cellular
   carriers wishing to deploy IETF-based mobility protocols. The current
   cellular carriers requirements [22, 23] are very similar to the
   ROAMOPS model, with the exception that the access protocol is
   Mobile-IP [45] instead of PPP.

   The Diameter protocol was not designed from the ground up. Instead,
   the basic RADIUS model was retained while fixing the flaws in the
   RADIUS protocol itself. Diameter does not share a common protocol
   data unit (PDU) with RADIUS, but does borrow sufficiently from the
   protocol to ease migration.

   The basic concept behind Diameter is to provide a base protocol that
   can be extended in order to provide AAA services to new access
   technologies. Currently, the protocol only concerns itself with
   Internet access, both in the traditional PPP sense as well as taking
   into account the ROAMOPS model, and Mobile-IP.

   Although Diameter could be used to solve a wider set of AAA problems,
   we are currently limiting the scope of the protocol in order to



Calhoun et al.           expires December 2001                  [Page 6]





Internet-Draft                                                 June 2001


   ensure that the effort remains focused on satisfying the requirements
   of network access. Note that a truly generic AAA protocol used by
   many applications might provide functionality not provided by
   Diameter. Therefore, it is imperative that the designers of new
   applications understand their requirements before using Diameter.


1.1  Diameter Protocol

   The Diameter protocol allows peers to exchange a variety of messages.
   The base protocol provides the following facilities:

      - Delivery of AVPs (attribute value pairs)
      - Capabilities negotiation, as required in [20]
      - Error notification
      - Extensibility, through addition of new commands and AVPs, as
        required in [21]

   All data delivered by the protocol is in the form of an AVP.  Some of
   these AVP values are used by the Diameter protocol itself, while
   others deliver data associated with particular applications which
   employ Diameter.  AVPs may be added arbitrarily to Diameter messages,
   so long as the required AVPs are included and AVPs which are
   explicitly excluded are not included.  AVPs are used by base Diameter
   protocol to support the following required features:

      - Transporting of user authentication information, for the
        purposes of enabling the Diameter server to authenticate the
        user.
      - Transporting of service specific authorization information,
        between client and servers, allowing the peers to decide whether
        a user's access request should be granted.
      - Exchanging resource usage information, which MAY be used for
        accounting purposes, capacity planning, etc.
      - Relaying, proxying and re-directing of Diameter messages through
        a server hierarchy.

   The Diameter base protocol provides the minimum requirements needed
   for an AAA transport protocol, as required by NASREQ [21], Mobile IP
   [22, 23], and ROAMOPS [20]. The base protocol is not intended to be
   used by itself, and must be used with a Diameter application, such as
   Mobile IP [10]. The Diameter protocol was heavily inspired and builds
   upon the tradition of the RADIUS [1] protocol. See section 2.4. for
   more information on Diameter applications.

   Any node can initiate a request. In that sense, Diameter is a peer to
   peer protocol. In this document, a Diameter client is the device that
   normally initiates a request for authentication and/or authorization



Calhoun et al.           expires December 2001                  [Page 7]





Internet-Draft                                                 June 2001


   of a user. A Diameter server is the device that either forwards the
   request to another Diameter server (known as a proxy), or one that
   performs the actual authentication and/or authorization of the user
   based on some profile. Given that the server MAY send unsolicited
   messages to clients, it is possible for the server to initiate such
   messages. An example of an unsolicited message would be for a request
   that the client issue an accounting update.


1.2  Requirements language

   In this document, the key words "MAY", "MUST", "MUST NOT",
   "optional", "recommended", "SHOULD", and "SHOULD NOT", are to be
   interpreted as described in [13].


1.3  Terminology

   Accounting
      The act of collecting information on resource usage for the
      purpose of trend analysis, auditing, billing, or cost allocation.

   Accounting record
      A session record represents a summary of the resource consumption
      of a user over the entire session. Accounting gateways creating
      the session record may do so by processing interim accounting
      events or accounting events from several

   Authentication
      The act of verifying the identity of an entity (subject).

   Authorization
      The act of determining whether a requesting entity (subject) will
      be allowed access to a resource (object).

   AVP
      The Diameter protocol consists of a header followed by one or more
      Attribute-Value-Pair (AVP). The AVP includes a header and is used
      to encapsulation authentication, authorization or accounting
      information.

   Broker
      A broker is a business term commonly used in AAA infrastructures.
      A broker is either a relay, proxy or redirect server, and MAY be
      operated by roaming consortiums.

   Diameter Agent




Calhoun et al.           expires December 2001                  [Page 8]





Internet-Draft                                                 June 2001


      A Diameter Agent is a host that is providing either server, relay,
      proxy or redirector services.

   Diameter Client
      A Diameter Client is a device at the edge of the network that
      performs access control. An example of a Diameter client is a
      Network Access Server (NAS) or a Foreign Agent (FA).

   Diameter Node
      A Diameter node is a host that implements the Diameter protocol,
      and acts either as a Client, or as a Proxy, Redirector, Server or
      Translation agent.

   Diameter Server
      A Diameter Server is one that handles authentication,
      authorization and accounting requests for a particular realm. By
      its very nature, a Diameter Server MUST support Diameter
      applications in addition to the base protocol.

   Downstream Server
      Diameter Proxy servers identify a downstream server as one that is
      providing routing services towards the Diameter client.

   Home Domain
      A Home Domain is the administrative domain with whom the user
      maintains an account relationship.

   Home Server
      See Diameter Server.

   Interim accounting
      An interim accounting message provides a snapshot of usage during
      a user's session. It is typically implemented in order to provide
      for partial accounting of a user's session in the event of a
      device reboot or other network problem that prevents the reception
      of a session summary message or session record.

   Local Domain
      A local domain is the administrative domain providing services to
      a user. An administrative domain MAY act as a local domain for
      certain users, while being a home domain for others.

   Network Access Identifier
      The Network Access Identifier, or NAI [3], is used in the Diameter
      protocol to extract a user's identity and realm. The identity is
      used to identify the user during authentication and/or
      authorization, while the realm is used for message routing
      purposes.



Calhoun et al.           expires December 2001                  [Page 9]





Internet-Draft                                                 June 2001


   Proxy
      In addition to forwarding requests and responses, proxies enforce
      policies relating to resource usage and provisioning.  This is
      typically accomplished by tracking the state of NAS devices. While
      proxies typically do not respond to client Requests prior to
      receiving a Response from the server, they may originate Reject
      messages in cases where policies are violated. As a result,
      proxies need to understand the semantics of the messages passing
      through them, and may not support all Diameter applications.

   Realm
      The string in the NAI that immediately follows the '@' character.
      NAI realm names are required to be unique, and are piggybacked on
      the administration of the DNS namespace. Diameter makes use of the
      realm, also loosely referred to as domain, to determine whether
      messages can be satisfied locally, or whether they must be
      proxied.

   Real-time Accounting
      Real-time accounting involves the processing of information on
      resource usage within a defined time window. Time constraints are
      typically imposed in order to limit financial risk.

   Relay
      Relays forward requests and responses based on routing-related
      AVPs and domain forwarding table entries. Since relays do not
      enforce policies, they do not examine or alter non-routing AVPs.
      As a result, relays never originate messages, do not need to
      understand the semantics of messages or non-routing AVPs, and are
      capable of handling any Diameter applications or message type.
      Since relays make decisions based on information in routing AVPs
      and domain forwarding tables they do not keep state on NAS
      resource usage or conversations in progress.


   Redirector
      Rather than forwarding requests and responses between clients and
      servers, Re-directs refer clients to servers and allow them to
      communicate directly. Since Re-directs do not sit in the
      forwarding path, they do not alter any AVPs transitting between
      client and server. Re-direct proxies do not originate messages and
      are capable of handling any message type, although they may be
      configured only to re-direct messages of certain types, while
      acting as Routing or Policy proxies for other types.  As with
      Routing proxies, re-directs do not keep state with respect to
      conversations or NAS resources.

   Roaming Relationships



Calhoun et al.           expires December 2001                 [Page 10]





Internet-Draft                                                 June 2001


      Roaming relationships include relationships between companies and
      ISPs, relationships among peer ISPs within a roaming association,
      and relationships between an ISP and a roaming consortia.
      Together, the set of relationships forming a path between a local
      ISP's authentication proxy and the home authentication server is
      known as the roaming relationship path.

   Session
      The Diameter protocol is session based. When an authorization
      request is initially transmitted, it includes a session identifier
      that is used for the duration of the session. The Session-
      Identifier AVP contains the identifier and must be globally
      unique.  devices serving the same user.

   Upstream Server
      Diameter Proxy servers identify an upstream server as one that is
      providing routing services towards the home server for a
      particular message.


2.0  Protocol Overview

   The base Diameter protocol is never used on its own.  It is always
   extended for a particular application.  Three Diameter applications
   are defined by companion documents:  NASREQ [7], Mobile IP [10],
   End-to-End Security [11].  These options are introduced in this
   document but specified elsewhere.  Additional Diameter applications
   MAY be defined in the future (see Section 15.3).

   Diameter Clients MUST support the base protocol, which includes
   accounting.  In addition, they MUST fully support each Diameter
   application which is needed to implement the client's service, e.g.
   NASREQ and/or Mobile IP. A Diameter Client which does not support
   both NASREQ and Mobile IP, MUST be referred to as "Diameter X Client"
   where X is the application which it supports, and not a "Diameter
   Client."

   Diameter Servers must support the base protocol, which includes
   accounting.  In addition, they MUST fully support each Diameter
   application which is needed to implement the intended service, e.g.
   NASREQ and/or Mobile IP. A Diameter Server which does not support
   both NASREQ and Mobile IP, MUST be referred to as "Diameter X Server"
   where X is the application which it supports, and not a "Diameter
   Server."

   Diameter Relays and Redirectors are, by definition, protocol
   transparent, and MUST transparently support the Diameter base
   protocol, which includes accounting, and all Diameter applications.



Calhoun et al.           expires December 2001                 [Page 11]





Internet-Draft                                                 June 2001


   Diameter Proxies MUST suppport the base protocol, which includes
   accounting.  in addition, they MUST fully support each Diameter
   application which is needed to implement proxied services, e.g.
   NASREQ and/or Mobile IP. A Diameter Proxy which does not support also
   both NASREQ and Mobile IP, MUST be referred to as "Diameter X Proxy"
   where X is the application which it supports, and not a "Diameter
   Proxy."

   The base Diameter protocol concerns itself with capabilities
   negotiation, and how messages are sent and how peers may eventually
   be abandoned.  The base protocol also defines certain rules which
   apply to all exchanges of messages between Diameter peers.

   Communication between Diameter peers begins with one peer sending a
   message to another Diameter peer. The set of AVPs included in the
   message is determined by a particular Diameter application. One AVP
   that is included to reference a user's session is the Session-Id.

   The initial request for authentication and/or authorization of a user
   would include the Session-Id. The Session-Id is then used in all
   subsequent messages to identify the user's session (see section 10.0
   for more information). The communicating party may accept the
   request, or reject it by returning an answer message with Result-Code
   AVP set to indicate an error occurred. The specific behavior of the
   diameter server or client receiving a request depends on the Diameter
   application employed.

   Session state (associated with a Session-Id) MUST be freed upon
   receipt of the Session-Termination-Request, Session-Termination-
   Answer, expiration of authorized service time in the Session-Timeout
   AVP, and according to rules established in a particular Diameter
   application.

   The Diameter base protocol provides the Authorization-Lifetime AVP,
   which MAY be used by applications to specify the duration of a
   specific authorized session.


2.1  Transport

   The base Diameter protocol is run on port TBD of both TCP [27] and
   SCTP [26] transport protocols (for interoperability test purposes
   port 1812 will be used until IANA assigns a port to the protocol).
   When used with TLS [38], The Diameter protocol is run on port TBD of
   both TCP and SCTP.

   Diameter clients MUST support either TCP or SCTP, while agents and
   servers MUST support both. Future versions of this specification MAY



Calhoun et al.           expires December 2001                 [Page 12]





Internet-Draft                                                 June 2001


   mandate that clients support SCTP.

   A Diameter node MAY initiate connections from any source port, but
   MUST be prepared to receive connections on port TBD. Note that the
   source and destination addresses used in request and replies MAY any
   of a peer's valid IP addresses.

   A given Diameter process SHOULD use the same port number to send all
   messages to aid in identifying which process sent a given message.
   More than one Diameter process MAY exist within a single host, so the
   sender's port number is needed to discriminate them.

   When no transport connection exists with a peer, an attempt to
   connect SHOULD be periodically attempted. This behavior is handled
   via the Tc timer, whose recommended value is 30 seconds.


2.1.1  SCTP Guidelines

   The following are guidelines for Diameter implementations that
   support SCTP:

      1. For interoperability: All Diameter nodes MUST be prepared to
         receive Diameter messages on any SCTP stream in the
         association.
      2. To prevent blocking: All Diameter nodes SHOULD utilize all SCTP
         streams available to the association to prevent head-of-the-
         line blocking.


2.2  Securing Diameter Messages

   Diameter clients, such as Network Access Servers (NASes) and Foreign
   Agents MUST support IP Security [37], and MAY support TLS [38].
   Diameter servers MUST support TLS, but the administrator MAY opt to
   configure IPSec instead of using TLS. Operating the Diameter protocol
   without any security mechanism is not recommended.


2.3  Diameter Protocol Extensibility

   There are various ways the Diameter protocol can be extended. This
   section is intended to assist protocol designers in selecting the
   best method of using the Diameter protocol.


2.3.1  Defining new AVP Values




Calhoun et al.           expires December 2001                 [Page 13]





Internet-Draft                                                 June 2001


   Defining a new AVP value is the best approach when a new application
   needs to make use of an existing Diameter application, but requires
   that an existing AVP communicate different service-specific
   information (e.g.  NAS-Port-Type set to avian carriers).

   When an existing AVP can be used to communicate the new information,
   this approach is preferred over creating new AVPs.

   In order to allocate a new AVP value, a request MUST be sent to IANA,
   with a detailed explanation of the value. Furthermore, if the command
   code on which the AVP value is to be used would require a different
   set of mandatory AVPs be present, the list of AVPs must accompany the
   request.


2.3.2  Creating new AVPs

   New AVPs may be created when a new application requiring Diameter
   support can make use of an existing Diameter application, but
   requires new AVPs to communicate service-specific information.

   Prior to defining the AVP, the AVP type MUST be one of the types
   listed in section 4.3. In the event that a logical grouping of AVPs
   is necessary, and multiple "groups" are possible in a given command,
   it is highly recommended that a Grouped AVP be used (see Section
   4.4).

   In order to create a new AVP, a request MUST be sent to IANA, with a
   detailed explanation of the AVP, its type and possible values.
   Furthermore, the request MUST include the commands that would make
   use of the AVP.

   Note that new AVPS to be used with an existing application MUST NOT
   be defined to have the 'M'andatory bit set.


2.3.3  Creating new Diameter Applications

   Should a new application require Diameter support, but it cannot fit
   within an existing application without requiring major changes to the
   specification, it may be desirable to create a new Diameter
   application.  Major changes to an application include:
      - Requiring a whole different set of mandatory AVPs to a command
      - Requiring a command that has a different number of round trips
        to satisfy a request (e.g. application foo has a command that
        requires one round trip, but new application bar has a command
        that requires two round trips to complete).
      - The method used to authenticate the user is drastically



Calhoun et al.           expires December 2001                 [Page 14]





Internet-Draft                                                 June 2001


        different from any existing application, and the authentication
        information cannot be carried within the AVPs defined in the
        application.

   Note that the creation of a new application should be viewed as a
   last resort.

   New Diameter applications MUST define at least one Command Code, the
   expected AVPs in an ABNF [31] grammar (see section 3.2), and MAY also
   define new AVPs. If the Diameter application has any accounting
   requirements, it MUST also specify the AVPs that are to be present in
   the Diameter Accounting messages (see section 11.3).

   When possible, a new Diameter application SHOULD attempt to re-use
   any existing Diameter AVP, in order to reduce the possibility of
   having multiple AVPs that carry similar information.

   Every Diameter application specification MUST have an IANA assigned
   Application Identifier (see section 2.4).


2.3.4  Application authentication procedures

   When possible, applications SHOULD be designed such that new
   authentication methods MAY be added without requiring changes to the
   application. This MAY require that new AVP values be assigned to
   represent the new authentication transform, or any other scheme that
   produces similar results. When possible, authentication frameworks,
   such as Extensible Authentication Protocol [25], SHOULD be used.


2.4  Diameter Application Compliance

   Application Identifiers are advertised during the capabilities
   exchange phase (see section 6.0). For a given application, there are
   two different ways of advertising support. First, advertising support
   of the application via the Auth-Application-Id implies that the
   sender supports all authentication and authorization command codes,
   and the AVPs specified in the associated ABNFs, described in the
   specification. Second, advertising support of the application via the
   Acct-Application-Id implies that the sender supports the Accounting
   command codes defined in this specification, as well as the
   accounting AVPs defined in the application's specification.

   An implementation MAY add arbitrary AVPs to any command defined in an
   application, including vendor-specific AVPs. However, implementations
   that add such AVPs with the Mandatory 'M' bit set are not compliant,
   and are at fault if the peer rejects the request. If the sender of



Calhoun et al.           expires December 2001                 [Page 15]





Internet-Draft                                                 June 2001


   such a message wishes to provide service, it MUST resend the message
   with the offending AVPs removed.


2.5  Role of Diameter Agents

   In addition to client and servers, the Diameter protocol introduces
   relays, redirectors, proxies and translation gateways, each of which
   is defined in Section 1.3. These Diameter agents are useful for
   several reasons:
      - They can distribute administration of systems to a configurable
        grouping, including the maintenance of security associations.
      - They can be used for concentration of requests from an number of
        co-located or distributed NAS equipment sets to a set of like
        user groups.
      - They can do value-added processing to the requests or responses.
      - They can used for load balancing.
      - A complex network will have multiple authentication sources,
        they can sort requests and forward towards the correct target.

   The Diameter protocol requires that agents maintain transaction
   state, which is used for failover purposes. Transaction state implies
   that upon forwarding a request, it's Hop-by-Hop identifier is saved,
   the field is replaced with a locally unique identifier, which is
   restored to its original value when the corresponding answer is
   received. The request's state is released upon receipt of the answer.
   A stateless agent is one that only maintains transaction state.

   The Proxy-Info AVP allows stateless agent to add local state to a
   Diameter request, with the guarantee that the same state will be
   present in the answer. However, the protocol's failover procedures
   requires that agents maintain a copy of pending requests.

   A stateful agent is one that maintains session state information, by
   keeping track of all authorized active sessions. Each authorized
   session is bound to a particular service, and its state is considered
   active either until it is notified otherwise, or by expiration. Each
   authorized session has a expiration, which is communicated by
   Diameter servers via the Authorized-Lifetime AVP.

   Maintaining session state MAY be useful in certain applications, such
   as:
      - Protocol translation (e.g. RADIUS <-> Diameter)
      - Limiting resources authorized to a particular user
      - Per user or transaction auditing

   A Diameter agent MAY act in a stateful manner for some requests,
   while be stateless for others. A Diameter implementation MAY act as



Calhoun et al.           expires December 2001                 [Page 16]





Internet-Draft                                                 June 2001


   one type of agent for some requests, and as another type of agent for
   others.


2.5.1  Relay Agents

   Relay Agents are Diameter agents that accept requests and routes the
   message to another Diameter agent based on information found in the
   message (e.g. Destination-Realm). This routing decision is performed
   using a list of supported domains, and known peers. This is known as
   the Diameter Routing Table, as is defined further in section x.x.

   Relays MAY be used to aggregate requests from multiple Network Access
   Servers (NASes) within a common geographical area (POP). The use of
   Relays is advantageous since it eliminates the need for NASes to be
   configured with the necessary security information it would otherwise
   require to communicate with Diameter servers in other realms.
   Likewise, this reduces the configuration load on Diameter servers
   that would otherwise be necessary when NASes are added, changed or
   deleted.

   Relays modify Diameter messages by inserting, and removing, routing
   information, but do not modify any other portion of a message.
   Further, Relays inherent simplicity implies that they are stateless,
   and therefore SHOULD NOT maintain session state, but MUST maintain
   transaction state.

      +------+    --------->     +------+     --------->    +------+
      |      |    1. Request     |      |     2. Request    |      |
      | NAS  |                   | DRL  |                   | HMS  |
      |      |    4. Answer      |      |     3. Answer     |      |
      +------+    <---------     +------+     <---------    +------+
      mno.net                     mno.net                    abc.com
                  Figure 1: Relaying of Diameter messages

   The example provided in Figure 1 depicts a request issued from NAS,
   which is an access device, for the user bob@abc.com. Prior to issuing
   the request, NAS performs a Diameter route lookup, using "abc.com" as
   the key, and determines that the message is to be relayed to DRL,
   which is a Diameter Relay. DRL performs the same route lookup as NAS,
   and relays the message to HMS, which is abc.com's Home Diameter
   Server. HMS identifies that the request can be locally supported (via
   the realm), processes the authentication and/or authorization
   request, and replies with an answer, which is routed back to NAS
   using Diameter routing AVPs.

   Since Relays do not perform any application level processing, they
   provide relaying services for all Diameter applications, and



Calhoun et al.           expires December 2001                 [Page 17]





Internet-Draft                                                 June 2001


   therefore MUST advertise the Relay Application Identifier.


2.5.2  Proxy Agents

   Similarly to Relays, Proxy agents route Diameter messages using the
   Diameter Routing Table. However, they differ since they modify
   messages to implement policy enforcement. This requires that proxies
   maintain the state of their downstream peers (e.g. access devices) to
   enforce resource usage, provide admission control, and provisioning.

   It is important to note that although proxies MAY provide a value-add
   function for NASes, they do not allow access devices to use the
   Diameter End-to-End Security application, since modifying messages
   breaks end-to-end authentication.

   Proxies MAY be used in call control centers or access ISPs that
   provide outsourced connections, they can monitor the number and types
   of ports in use, and make allocation and admission decisions
   according to their configuration.

   Proxies that wish to limit resources MUST be stateful, and all
   Proxies MUST maintain transaction state.

   Proxy agents MUST NOT allow end-to-end security to be established
   between two peers if it expects to modify ANY non-routing AVP in
   messages exchanged between the peers. See [11] for more information.

   Since enforcing policies requires an understanding of the service
   being provided, Proxies MUST only advertise the Diameter applications
   they support.


2.5.3  Redirector Agents

   Redirector agents provide Realm to Server address resolution, and use
   the Diameter routing table to determine where a given request should
   be forwarded to. When a request is received by a Diameter redirector,
   a special answer is created, which includes the identity of the
   Diameter server(s) the originator of the request should contact
   directly.

   Redirectors are useful in scenarios where the Diameter routing
   configuration needs to be centralized. An example is a redirector
   that provides services to all members of a consortium, but does not
   wish to be burdened with relaying all messages between domains.  This
   scenario is advantageous since it does not require that the
   consortium provide routing updates to its members when changes are



Calhoun et al.           expires December 2001                 [Page 18]





Internet-Draft                                                 June 2001


   made to a member's infrastructure.

   Since redirectors do not relay messages, and only return an answer
   with the information necessary for Diameter agents to communicate
   directly, they do not modify messages, and therefore MUST NOT
   maintain session state. Further, since redirectors never relay
   requests, they are not required to maintain transaction state.

                                 +------+
                                 |      |
                                 | DRD  |
                                 |      |
                                 +------+
                                  ^    |
                      2. Request  |    | 3. Redirection
                                  |    |    Notification
                                  |    v
      +------+    --------->     +------+     --------->    +------+
      |      |    1. Request     |      |     4. Request    |      |
      | NAS  |                   | DRL  |                   | HMS  |
      |      |    6. Answer      |      |     5. Answer     |      |
      +------+    <---------     +------+     <---------    +------+
      mno.net                     mno.net                    abc.com
                 Figure 2: Redirecting a Diameter Message


   The example provided in Figure 2 depicts a request issued from the
   access device, NAS, for the user bob@abc.com. The message is
   forwarded by the NAS to its relay, DRL, which does not have a routing
   entry in its Diameter Routing Table for abc.com. DRL has a default
   route configured to DRD, which is a redirector that returns a
   redirect notification to DLR, as well as HMS' contact information.
   Upon receipt of the redirect notification, DRL establishes a
   transport connection with HMS, if one doesn't already exist, and
   forwards the request to it.

   Since Redirectors do not perform any application level processing,
   they provide relaying services for all Diameter applications, and
   therefore MUST advertise the Relay Application Identifier.


2.5.4  Translation Agents

   A Translation Agent is a device that provides translation between two
   protocols (e.g. RADIUS<->Diameter, TACACS+<->Diameter). Translation
   agents are likely to be used as aggregation servers to communicate
   with a Diameter infrastructure, while allowing for the embedded
   systems to be migrated at a slower pace.



Calhoun et al.           expires December 2001                 [Page 19]





Internet-Draft                                                 June 2001


   Given that the Diameter protocol introduces the concept of long-lived
   authorized sessions, translation agents MUST be stateful and MUST
   maintain transaction state.

   Translation of messages can only occur if the agent recognizes the
   application of a particular request, and therefore MUST only
   advertise their locally supported applications.

      +------+    --------->     +------+     --------->    +------+
      |      |  RADIUS Request   |      |  Diameter Request |      |
      | NAS  |                   | TLA  |                   | HMS  |
      |      |  RADIUS Answer    |      |  Diameter Answer  |      |
      +------+    <---------     +------+     <---------    +------+
      mno.net                     mno.net                    abc.com
                Figure 3: Translation of RADIUS to Diameter


2.6  Diameter Agent Discovery

   Allowing for dynamic Diameter agent discovery will make it possible
   for simpler and more robust deployment of AAA services.  In order to
   promote interoperable implementations of Diameter agent discovery,
   the following mechanisms are described.  These are based on existing
   IETF standards.

   There are two cases where Diameter agent discovery may be performed.
   The first is when a Diameter client needs to discover a first-hop
   Diameter agent.  The second case is when a Diameter agent needs to
   discover another agent - for further handling of a Diameter
   operation. In both cases, the following 'search order' is
   recommended:

      1. The Diameter implementation consults its list of static
         (manual) configured Diameter agent locations.  These will be
         used if they exist and respond.

      2. The Diameter implementation uses SLPv2 [28] to discover
         Diameter services.  The Diameter service template [32] is
         included in Appendix A. It is recommended that SLPv2 security
         be deployed (this requires distributing keys to SLPv2 agents.)
         This is discussed further in Appendix A.

         SLPv2 will allow Diameter implementations to discover the
         location of Diameter agents in the local site, as well as their
         characteristics.  Diameter agents with specific capabilities
         (say support for the Mobile IP application) can be requested,
         and only those will be discovered.




Calhoun et al.           expires December 2001                 [Page 20]





Internet-Draft                                                 June 2001


      3. The Diameter implementation uses DNS to request the SRV RR [33]
         for the '_diameter._sctp' and/or '_diameter._tcp' server in a
         particular domain.  The Diameter implementation has to know in
         advance which domain to look for an Diameter agent in.  This
         could be deduced, for example, from the 'realm' in a NAI that
         an Diameter implementation needed to perform an Diameter
         operation on.

         Diameter allows AAA peers to protect the integrity and privacy
         of communication as well as to perform end-point
         authentication.  Still, it is prudent to employ DNS Security as
         a precaution when using DNS SRV RRs to look up the location of
         a Diameter agent.  [34, 35, 36]


2.7  Diameter Identity Encoding

   Several Diameter AVPs are used to include a node's identity, such as
   the Destination-Host, Origin-Host, Route-Record, etc. The contents of
   such AVPs follow the Uniform Resource Identifiers (URI) syntax [29]
   rules specified below:

      Diameter-Identity  = [protocol] fqdn [ port ]
                           [ transport ]

      protocol-name      = ( "diameter" | "radius" | "tacacs+" )

      protocol           = protocol-name "://"
      ; If absent, the default is "diameter://"

      fqdn               = Fully Qualified Host Name

      port               = ":" 1*DIGIT
      ; If absent, the default Diameter port (TBD) is assumed.

      transport          = ";transport=" ( "tcp" | "sctp" | "udp")
      ; If absent, the default SCTP [26] protocol is assumed.
      ; UDP is ONLY used when the protocol is set to RADIUS

   The following are examples of valid Diameter host identities:

      host.abc.com:6666;transport=tcp
      diameter://host.abc.com
      diameter://host.abc.com:6666
      diameter://host.abc.com;transport=tcp
      diameter://host.abc.com:6666;transport=tcp
      radius://host.abc.com:1813;transport=udp




Calhoun et al.           expires December 2001                 [Page 21]





Internet-Draft                                                 June 2001


3.0  Diameter Header

   A summary of the Diameter header format is shown below. The fields
   are transmitted in network byte order.

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |      Ver      |                 Message Length                |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |R r r r r r r r|                  Command-Code                 |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                           Vendor-ID                           |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                      Hop-by-Hop Identifier                    |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                      End-to-End Identifier                    |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |  AVPs ...
      +-+-+-+-+-+-+-+-+-+-+-+-+-

   Version
      This Version field MUST be set to 1 to indicate Diameter Version
      1.

   Message Length
      The Message Length field is two octets and indicates the length of
      the Diameter message including the header fields.

   Command Flags
      The Command Flags field is eight bits.  The following bits are
      assigned:

         R(equest)  - If set, the message is a request. If cleared, the
                      message is an answer.
         r(eserved) - this flag bit is reserved for future use, and MUST
                      be set to zero.

   Command-Code
      The Command-Code field is three octets, and is used in order to
      communicate the command associated with the message. The 24-bit
      address space is managed by IANA (see section 15.2).

   Vendor-ID
      In the event that the Command-Code field contains a vendor
      specific command, the four octet Vendor-ID field contains the IANA
      assigned "SMI Network Management Private Enterprise Codes" [2]
      value. If the Command-Code field contains an IETF standard



Calhoun et al.           expires December 2001                 [Page 22]





Internet-Draft                                                 June 2001


      Command, the Vendor-ID field MUST be set to zero (0). Any vendor
      wishing to implement a vendor-specific Diameter command MUST use
      their own Vendor-ID along with their privately managed Command-
      Code address space, guaranteeing that they will not collide with
      any other vendor's vendor-specific command, nor with future IETF
      applications.


   Hop-by-Hop Identifier
      The Hop-by-Hop Identifier field is four octets, and aids in
      matching requests and replies. The sender MUST ensure that the
      Hop-by-Hop identifier in a request is locally unique (to the
      sender) at any given time, and MAY attempt to ensure that the
      number is unique across reboots. The sender of an Answer message
      MUST ensure that the Hop-by-Hop Identifier field contains the same
      value that was found in the corresponding request.  The Hop-by-Hop
      identifier is normally a monotonically increasing number, whose
      start value was randomly generated. An answer message that is
      received with an unknown Hop-by-Hop Identifier MUST be discarded.

   End-to-End Identifier
      Unlike the Hop-by-Hop Identifier, the End-to-End Identifier is
      used to detect duplicate messages, and relay agents MUST NOT
      modify this field. The sender of a request or answer message MUST
      insert a locally unique value in this field. The combination of
      the Origin-Host AVP and this field is used to detect duplicates.
      An Answer message which is received with a previously seen End-
      to-End Identifier, and is to be locally consumed (meaning that the
      Destination-Host AVP contains the local node's identity) SHOULD be
      silently discarded.

   AVPs
      AVPs are a method of encapsulating information relevant to the
      Diameter message. See section 4. for more information on AVPs.


3.1  Command Codes

   Each command Request/Answer pair is assigned a command code, and the
   sub-type (e.g. request or answer) is identified via the 'R' bit in
   the Command Flags field of the Diameter header.

   Every Diameter message MUST contain a command code in its header's
   Command-Code field, which is used to determine the action that is to
   be taken for a particular message. The following Command Codes are
   defined in the Diameter base protocol:





Calhoun et al.           expires December 2001                 [Page 23]





Internet-Draft                                                 June 2001


         Command-Name             Abbrev.    Code       Reference
         --------------------------------------------------------
         Abort-Session-Request     ASR       274           10.8.1
         Abort-Session-Answer      ASA       274           10.8.2
         Accounting-Answer         ACA       271           12.2
         Accounting-Poll-Ind       API       273           12.3
         Accounting-Request        ACR       271           12.1
         Capabilities-Exchange-    CER       257           6.2
            Request
         Capabilities-Exchange-    CEA       257           6.3
            Answer
         Message-Reject-Answer     MRA       282           9.2
         Device-Watchdog-Answer    DWA       280           7.2
         Device-Watchdog-Request   DWR       280           7.1
         Session-Termination-      STR       275           10.7.1
            Request
         Session-Termination-      STA       275           10.7.2


3.2  Command Code ABNF specification

   Every Command Code defined MUST include a corresponding ABNF
   specification, which is used to define the AVPs that MUST, MAY and
   MUST NOT be present.  The following format is used in the definition:

      command-def      = command-name "::=" diameter-message

      diameter-name    = ALPHA *(ALPHA / DIGIT / "-")

      command-name     = diameter-name
                          ; The command-name has to be Command name,
                          ; defined in the base or extended Diameter
                          ; specifications.

      diameter-message = header  [ *fixed] [ *required] [ *optional]
                         [ *fixed]

      header           = "<Diameter-Header:" command-id [r-bit] ">"

      command-id       = 1*DIGIT
                          ; The Command Code assigned to the command

      r-bit            = ", REQUEST"
                          ; If present, the 'R' bit in the Command
                          ; Flags is set, indicating that the message
                          ; is a request, as opposed to an answer.

      fixed            = [qual] "<" avp-spec ">"



Calhoun et al.           expires December 2001                 [Page 24]





Internet-Draft                                                 June 2001


      required         = [qual] "{" avp-spec "}"

      optional         = [qual] "[" avp-name "]"
                          ; The avp-name in the 'optional' rule cannot
                          ; evaluate to any AVP Name which is included
                          ; in a fixed or required rule.

      qual             = [min] "*" [max]
                          ; See ABNF conventions, RFC 2234 section 6.6.
                          ; The absence of any qualifiers implies that
                          ; one and only one such AVP MUST be present.
                          ;
                          ; NOTE:  "[" and "]" have a different meaning
                          ; than in ABNF (see the optional rule, above).
                          ; These braces cannot be used to express
                          ; optional fixed rules (such as an optional
                          ; ICV at the end.)  To do this, the convention
                          ; is '0*1fixed'.

      min              = 1*DIGIT
                          ; The minimum number of times the element may
                          ; be present.

      max              = 1*DIGIT
                          ; The maximum number of times the element may
                          ; be present.

      avp-spec         = diameter-name
                          ; The avp-spec has to be an AVP Name, defined
                          ; in the base or extended Diameter
                          ; specifications.

      avp-name         = avp-spec | "AVP"
                          ; The string "AVP" stands for *any* arbitrary
                          ; AVP Name, which does not conflict with the
                          ; required or fixed position AVPs defined in
                          ; the command code definition.

   The following is a definition of a fictitious command code:

      Example-Request ::= < Diameter-Header: 9999999, REQUEST >
                          { User-Name }
                        * { Origin-Host }
                        * [ AVP ]


3.3  Diameter Command Naming Conventions




Calhoun et al.           expires December 2001                 [Page 25]





Internet-Draft                                                 June 2001


   The following conventions are required for the naming of Diameter
   messages. Diameter commands typically start with an object name, and
   end with either the Request or Answer verb.

   The Request/Answer message pair is used when a Diameter node requests
   that some action be performed by a peer (e.g. authorize a user,
   terminate a session). The corresponding answer MUST contain either a
   positive or negative result code, informing the requester whether the
   request was successful or not. Other information MAY also be returned
   in the Answer message.

   Request and Answer messages share the same command code, and the
   R(equest) bit in the Diameter header is used to identify whether a
   message is the request or answer.


4.0  Diameter AVPs

   Diameter AVPs carry specific authentication, accounting and
   authorization information, security information as well as
   configuration details for the request and reply.

   Some AVPs MAY be listed more than once. The effect of such an AVP is
   specific, and is specified in each case by the AVP description.

   Each AVP of type OctetString MUST be padded to align on a 32 bit
   boundary, while other AVP types align naturally. NULL bytes are added
   to the end of the AVP Data field till a word boundary is reached. The
   length of the padding is not reflected in the AVP Length field.


4.1  AVP Header

   The fields in the AVP header MUST be sent in network byte order.  The
   format of the header is:

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                           AVP Code                            |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |V M P r r r r r|                  AVP Length                   |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                        Vendor-ID (opt)                        |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |    Data ...
      +-+-+-+-+-+-+-+-+




Calhoun et al.           expires December 2001                 [Page 26]





Internet-Draft                                                 June 2001


   AVP Code
      The AVP Code, combined with the Vendor-Id field, identifies the
      attribute uniquely. The first 256 AVP numbers are reserved for
      backward compatibility with RADIUS and are to be interpreted as
      per NASREQ [7].  AVP numbers 256 and above are used for Diameter,
      which are allocated by IANA (see section 15.1).

   AVP Flags
      The AVP Flags field informs the receiver how each attribute must
      be handled. Note that subsequent Diameter applications MAY define
      bits to be used within the AVP Header, and an unrecognized bit
      should be considered an error. The 'r' and the reserved bits are
      unused and should be set to 0 and ignored on receipt, while the
      'P' bit is defined in [11].

      The 'M' Bit, known as the Mandatory bit, indicates whether support
      of the AVP is required. If an unrecognized AVP with the 'M' bit
      set is received by a Diameter node, the message MUST be rejected.
      Diameter Relay and Redirector agents MUST NOT reject messages with
      unrecognized AVPs.

      A Diameter node that sets the 'M' bit in an AVP that is not
      defined in a given message's ABNF is at fault if the message is
      rejected. In order to provide service to the user, the node at
      fault MUST re-issue a request either without the AVP, or without
      setting its 'M' bit.

      A Diameter node that rejects a message due to an unrecognized AVP
      with the 'M' bit set, and the AVP in question is defined in the
      message's ABNF is at fault. In most cases the initiator of the
      failing request will not provide service to the user.

      AVPs with the 'M' bit cleared are informational only and a
      receiver that receives a message with such an AVP that is not
      supported MAY simply ignore the AVP.

      The 'V' bit, known as the Vendor-Specific bit, indicates whether
      the optional Vendor-ID field is present in the AVP header. When
      set the AVP Code belongs to the specific vendor code address
      space.

      Unless otherwise noted, AVPs will have the following default AVP
      Flags field settings:
         The 'M' bit MUST be set. The 'V' bit MUST NOT be set.

   AVP Length
      The AVP Length field is three octets, and indicates the length of
      this AVP including the AVP Code, AVP Length, AVP Flags, Reserved,



Calhoun et al.           expires December 2001                 [Page 27]





Internet-Draft                                                 June 2001


      the Vendor-ID field (if present) and the AVP data. If a message is
      received with an invalid attribute length, the message SHOULD be
      rejected.


4.2  Optional Header Elements

   The AVP Header contains one optional field. This field is only
   present if the respective bit-flag is enabled.

   Vendor-ID
      The Vendor-ID field is present if the 'V' bit is set in the AVP
      Flags field. The optional four octet Vendor-ID field contains the
      IANA assigned "SMI Network Management Private Enterprise Codes"
      [2] value, encoded in network byte order. Any vendor wishing to
      implement a vendor-specific Diameter AVP MUST use their own
      Vendor-ID along with their privately managed AVP address space,
      guaranteeing that they will not collide with any other vendor's
      vendor-specific AVP, nor with future IETF applications.

      A vendor ID value of zero (0) corresponds to the IETF adopted AVP
      values, as managed by the IANA. Since the absence of the vendor ID
      field implies that the AVP in question is not vendor specific,
      implementations SHOULD not use the zero (0) vendor ID.


4.3  AVP Data Formats

   The Data field is zero or more octets and contains information
   specific to the Attribute. The format and length of the Data field is
   determined by the AVP Code and AVP Length fields. The format of the
   Data field MAY be one of the following data types.

   The interpretation of the values depends on the specification of the
   AVP.  For example, an OctetString may be used to transmit human
   readable string data and Unsigned32 may be used to transmit a time
   value.  Conventions for these common interpretations are described
   below.

      OctetString
         The data contains arbitrary data of variable length. Unless
         otherwise noted, the AVP Length field MUST be set to at least 8
         (12 if the 'V' bit is enabled).  Data used to transmit (human
         readable) character string data uses the UTF-8 [24] character
         set and is NOT NULL-terminated. The minimum Length field MUST
         be 9, but can be set to any value up to 65504 bytes. AVP Values
         of this type that do not align on a 32-bit boundary MUST have
         the necessary padding.



Calhoun et al.           expires December 2001                 [Page 28]





Internet-Draft                                                 June 2001


      Address
         32 bit (IPv4) [17] or 128 bit (IPv6) [16] address, most
         significant octet first. The format of the address (IPv4 or
         IPv6) is determined by the length. If the attribute value is an
         IPv4 address, the AVP Length field MUST be 12 (16 if 'V' bit is
         enabled), otherwise the AVP Length field MUST be set to 24 (28
         if the 'V' bit is enabled) for IPv6 addresses.

      Integer32
         32 bit signed value, in network byte order. The AVP Length
         field MUST be set to 12 (16 if the 'V' bit is enabled).

      Integer64
         64 bit signed value, in network byte order. The AVP Length
         field MUST be set to 16 (20 if the 'V' bit is enabled).

      Unsigned32
         32 bit unsigned value, in network byte order. The AVP Length
         field MUST be set to 12 (16 if the 'V' bit is enabled).
         Unsigned32 values used to transmit time data contains the four
         most significant octets returned from NTP [18], in network byte
         order.

      Unsigned64
         64 bit unsigned value, in network byte order. The AVP Length
         field MUST be set to 16 (20 if the 'V' bit is enabled).

      Float32
         This represents floating point values of single precision as
         described by [30].  The 32 bit value is transmitted in network
         byte order. The AVP Length field MUST be set to 12 (16 if the
         'V' bit is enabled).

      Float64
         This represents floating point values of double precision as
         described by [30].  The 64 bit value is transmitted in network
         byte order. The AVP Length field MUST be set to 16 (20 if the
         'V' bit is enabled).

      Float128
         This represents floating point values of quadruple precision as
         described by [30].  The 128 bit value is transmitted in network
         byte order. The AVP Length field MUST be set to 24 (28 if the
         'V' bit is enabled).

      Grouped
         The Data field is specified as a sequence of AVPs.  Each of
         these AVPs follows including their headers and padding.  The



Calhoun et al.           expires December 2001                 [Page 29]





Internet-Draft                                                 June 2001


         AVP Length field is set to 8 (12 if the 'V' bit is enabled)
         plus the total length of all included AVPs, including their
         headers and padding.


4.4  Grouped AVP Values

   The Diameter protocol allows AVP values of type 'Grouped.' This
   implies that the Data field is actually a sequence of AVPs.  It is
   possible to include an AVP with a Grouped type within a Grouped type,
   that is, to nest them. AVPs within an AVP of type Grouped have the
   same padding requirements as non-Grouped AVPs, as defined in section
   4.0.

   Every Grouped AVP defined MUST include a corresponding grammar, using
   ABNF [31] (with modifications), as defined below.

      avp-def          = name "::=" avp

      name-fmt         = ALPHA *(ALPHA / DIGIT / "-")

      name             = name-fmt
                          ; The name has to be the name of an AVP,
                          ; defined in the base or extended Diameter
                          ; specifications.

      avp              = header  [ *fixed] [ *required] [ *optional]
                         [ *fixed]

      header           = "<AVP-Header:" avpcode ">"

      avpcode          = 1*DIGIT
                          ; The AVP Code assigned to the Grouped AVP

      fixed            = [qual] "<" avp-spec ">"

      required         = [qual] "{" avp-spec "}"

      optional         = [qual] "[" avp-name "]"
                          ; The avp-name in the 'optional' rule cannot
                          ; evaluate to any AVP Name which is included
                          ; in a fixed or required rule.

      qual             = [min] "*" [max]
                          ; See ABNF conventions, RFC 2234 section 6.6.
                          ; The absence of any qualifiers implies that
                          ; one and only one such AVP MUST be present.
                          ;



Calhoun et al.           expires December 2001                 [Page 30]





Internet-Draft                                                 June 2001


                          ; NOTE:  "[" and "]" have a different meaning
                          ; than in ABNF (see the optional rule, above).
                          ; These braces cannot be used to express
                          ; optional fixed rules (such as an optional
                          ; ICV at the end.)  To do this, the convention
                          ; is '0*1fixed'.

      min              = 1*DIGIT
                          ; The minimum number of times the element may
                          ; be present.

      max              = 1*DIGIT
                          ; The maximum number of times the element may
                          ; be present.

      avp-spec         = name-fmt
                          ; The avp-spec has to be an AVP Name, defined
                          ; in the base or extended Diameter
                          ; specifications.

      avp-name         = avp-spec | "AVP"
                          ; The string "AVP" stands for *any* arbitrary
                          ; AVP Name, which does not conflict with the
                          ; required or fixed position AVPs defined in
                          ; the command code definition.


4.4.1  Example AVP with a Grouped Data type

   The Example AVP (AVP Code 999999) is of type Grouped and is used to
   clarify how Grouped AVP values work.  The Grouped Data field has the
   following ABNF grammar:

      Example-AVP  ::= < AVP Header: 999999 >
                       { Origin-Host }
                     1*{ Session-Id }
                      *[ AVP ]

   An Example AVP with Grouped Data follows.

   The Origin-Host AVP is required.  In this case:

      Origin-Host = "example.com".

   One or more Session-Ids must follow.  Here there are two:

      Session-Id =
        "grump.example.com:33041;23432;893;0AF3B81"



Calhoun et al.           expires December 2001                 [Page 31]





Internet-Draft                                                 June 2001


      Session-Id =
        "grump.example.com:33054;23561;2358;0AF3B82"

   optional AVPs included are

      Recovery-Policy = <binary>
         2163bc1d0ad82371f6bc09484133c3f09ad74a0dd5346d54195a7cf0b35
         2cabc881839a4fdcfbc1769e2677a4c1fb499284c5f70b48f58503a45c5
         c2d6943f82d5930f2b7c1da640f476f0e9c9572a50db8ea6e51e1c2c7bd
         f8bb43dc995144b8dbe297ac739493946803e1cee3e15d9b765008a1b2a
         cf4ac777c80041d72c01e691cf751dbf86e85f509f3988e5875dc905119
         26841f00f0e29a6d1ddc1a842289d440268681e052b30fb638045f7779c
         1d873c784f054f688f5001559ecff64865ef975f3e60d2fd7966b8c7f92

      Futuristic-Acct-Record = <binary>
         fe19da5802acd98b07a5b86cb4d5d03f0314ab9ef1ad0b67111ff3b90a0
         57fe29620bf3585fd2dd9fcc38ce62f6cc208c6163c008f4258d1bc88b8
         17694a74ccad3ec69269461b14b2e7a4c111fb239e33714da207983f58c
         41d018d56fe938f3cbf089aac12a912a2f0d1923a9390e5f789cb2e5067
         d3427475e49968f841

   The data for the optional AVPs is represented in hex since the format
   of these AVPs is neither known at the time of definition of the
   Example-AVP group, nor (likely) at the time when the example instance
   of this AVP is interpreted - except by Diameter implementations which
   support the same set of AVPs.  The encoding example illustrates how
   padding is used, how length fields are calculated and how AVPs do not
   have to begin on 8 byte boundaries.  Also note that AVPs may be
   present in the Grouped AVP value which the receiver cannot interpret
   (here, the Recover-Policy and Futuristic-Acct-Record AVPs).

   This AVP would be encoded as follows:



















Calhoun et al.           expires December 2001                 [Page 32]





Internet-Draft                                                 June 2001


           0       1       2       3       4       5       6       7
       +-------+-------+-------+-------+-------+-------+-------+-------+
     0 |     Example AVP Header (AVP Code = 999999), Length = 468      |
       +-------+-------+-------+-------+-------+-------+-------+-------+
     8 |     Origin-Host AVP Header (AVP Code = 264), Length = 19      |
       +-------+-------+-------+-------+-------+-------+-------+-------+
    16 |  'e'  |  'x'  |  'a'  |  'm'  |  'p'  |  'l'  |  'e'  |  '.'  |
       +-------+-------+-------+-------+-------+-------+-------+-------+
    24 |  'c'  |  'o'  |  'm'  |Padding|     Session-Id AVP Header     |
       +-------+-------+-------+-------+-------+-------+-------+-------+
    32 | (AVP Code = 263), Length = 50 |  'g'  |  'r'  |  'u'  |  'm'  |
       +-------+-------+-------+-------+-------+-------+-------+-------+
                                     . . .
       +-------+-------+-------+-------+-------+-------+-------+-------+
    64 |  'A'  |  'F'  |  '3'  |  'B'  |  '8'  |  '1'  |Padding|Padding|
       +-------+-------+-------+-------+-------+-------+-------+-------+
    68 |     Session-Id AVP Header (AVP Code = 263), Length = 51       |
       +-------+-------+-------+-------+-------+-------+-------+-------+
    72 |  'g'  |  'r'  |  'u'  |  'm'  |  'p'  |  '.'  |  'e'  |  'x'  |
       +-------+-------+-------+-------+-------+-------+-------+-------+
                                     . . .
       +-------+-------+-------+-------+-------+-------+-------+-------+
   104 |  '0'  |  'A'  |  'F'  |  '3'  |  'B'  |  '8'  |  '2'  |Padding|
       +-------+-------+-------+-------+-------+-------+-------+-------+
   112 |   Recovery-Policy Header (AVP Code = 8341), Length = 223      |
       +-------+-------+-------+-------+-------+-------+-------+-------+
   120 |  0x21 | 0x63  | 0xbc  | 0x1d  | 0x0a  | 0xd8  | 0x23  | 0x71  |
       +-------+-------+-------+-------+-------+-------+-------+-------+
                                     . . .
       +-------+-------+-------+-------+-------+-------+-------+-------+
   320 |  0x2f | 0xd7  | 0x96  | 0x6b  | 0x8c  | 0x7f  | 0x92  |Padding|
       +-------+-------+-------+-------+-------+-------+-------+-------+
   328 | Futuristic-Acct-Record Header (AVP Code = 15930), Length = 137|
       +-------+-------+-------+-------+-------+-------+-------+-------+
   336 |  0xfe | 0x19  | 0xda  | 0x58  | 0x02  | 0xac  | 0xd9  | 0x8b  |
       +-------+-------+-------+-------+-------+-------+-------+-------+
                                     . . .
       +-------+-------+-------+-------+-------+-------+-------+-------+
   464 |  0x41 |Padding|Padding|Padding|
       +-------+-------+-------+-------+


4.5  Diameter Base Protocol AVPs

   The following table describes the Diameter AVPs defined in the base
   protocol, their AVP Code values, types, possible flag values and
   whether the AVP MAY be encrypted.




Calhoun et al.           expires December 2001                 [Page 33]





Internet-Draft                                                 June 2001


                                            +---------------------+
                                            |    AVP Flag rules   |
                                            |----+-----+----+-----|----+
                   AVP  Section             |    |     |SHLD| MUST|MAY |
   Attribute Name  Code Defined  Data Type  |MUST| MAY | NOT|  NOT|Encr|
   -----------------------------------------|----+-----+----+-----|----|
   Accounting-      482  13.2    Unsigned32 | M  |  P  |    |  V  | Y  |
     Interim-Interval                       |    |     |    |     |    |
   Accounting-      50   13.5    OctetString| M  |  P  |    |  V  | Y  |
     Multi-Session-Id                       |    |     |    |     |    |
   Accounting-      485  13.3    Unsigned32 | M  |  P  |    |  V  | Y  |
     Record-Number                          |    |     |    |     |    |
   Accounting-      480  13.1    Unsigned32 | M  |  P  |    |  V  | Y  |
     Record-Type                            |    |     |    |     |    |
   Accounting-       44  13.4    OctetString| M  |  P  |    |  V  | Y  |
     Session-Id                             |    |     |    |     |    |
   Acct-            259  6.10    Integer32  | M  |     |    |  V  | N  |
     Application-Id                         |    |     |    |     |    |
   Auth-            258  6.6     Integer32  | M  |     |    |  V  | N  |
     Application-Id                         |    |     |    |     |    |
   Authorization-   291  10.4    Unsigned32 | M  |     |    |  V  | N  |
     Lifetime                               |    |     |    |     |    |
   Destination-Host 293  5.6     OctetString| M  |     |    |  V  | N  |
   Destination-     283  5.7     OctetString| M  |     |    |  V  | N  |
     Realm                                  |    |     |    |     |    |
   Error-Message    281  9.3     OctetString|    |     |    |  V  | N  |
   Error-Reporting- 294  9.4     OctetString|    |     |    |  V  | N  |
     Host                                   |    |     |    |     |    |
   Failed-AVP       279  9.5     OctetString| M  |     |    |  V  | Y  |
   Firmware-        267  6.5     Unsigned32 |    |     |    | V,M | N  |
     Revision                               |    |     |    |     |    |
   Host-IP-Address  257  6.7     Address    | M  |     |    |  V  | N  |
   Origin-Host      264  5.4     OctetString| M  |     |    |  V  | N  |
   Origin-Realm     296  5.5     OctetString| M  |     |    |  V  | N  |
   Product-Name     269  6.9     OctetString|    |     |    |     | N  |
   Proxy-Host       280  5.8.3   Address    | M  |     |    |  V  | N  |
   Proxy-Info       284  5.8.2   Grouped    | M  |     |    |  V  | N  |
   Proxy-State       33  5.8.4   OctetString| M  |     |    |  V  | N  |
   Redirect-Host    292  5.9     OctetString| M  |     |    |  V  | Y  |
   Result-Code      268  9.1     Unsigned32 | M  |     |    |  V  | N  |
   Route-Record     282  5.8.1   OctetString| M  |     |    |  V  | N  |
   Session-Id       263  10.3    OctetString| M  |     |    |  V  | Y  |
   Session-Timeout   27  10.5    Unsigned32 | M  |     |    |  V  | N  |
   Origin-State-Id  278  10.11   Unsigned32 | M  |     |    |  V  | N  |
   Supported-       265  6.8     Unsigned32 | M  |     |    |  V  | N  |
     Vendor-Id                              |    |     |    |     |    |
   -----------------------------------------|----+-----+----+-----|----|




Calhoun et al.           expires December 2001                 [Page 34]





Internet-Draft                                                 June 2001


                                            +---------------------+
                                            |    AVP Flag rules   |
                                            |----+-----+----+-----|----+
                   AVP  Section             |    |     |SHLD| MUST|MAY |
   Attribute Name  Code Defined  Data Type  |MUST| MAY | NOT|  NOT|Encr|
   -----------------------------------------|----+-----+----+-----|----|
   Termination-     295  10.9    Unsigned32 | M  |     |    |  V  | N  |
      Cause                                 |    |     |    |     |    |
   User-Name          1  10.6    OctetString| M  |     |    |  V  | Y  |
   Vendor-Id        266  6.4     Unsigned32 | M  |     |    | V,M | N  |
   Vendor-Specific- 260  6.11    Grouped    | M  |     |    | V,M | N  |
      Application-Id
   -----------------------------------------|----+-----+----+-----|----|


5.0  Diameter message processing

   All Diameter messages MUST include the Origin-Host and Origin-Realm
   AVPs, which are used to identify the source of the message.  The
   Destination-Host AVP MAY be present in requests, and MUST be present
   in answers. The Destination-Host AVP is used when the destination of
   the message is fixed, which includes:

      - Authentication requests that span multiple round trips
      - A Diameter message that uses a security mechanism that makes use
        of a pre-established session key shared between the source and
        the final destination of the message.
      - Server initiated messages that MUST be received by a specific
        Diameter client (e.g. access device), such as the Abort-
        Session-Request message, which is used to request that a
        particular user's session be terminated.

   The Destination-Realm AVP MUST be present if the message is routable.
   A message that MUST NOT be relayed, proxied or redirected MUST NOT
   include the Destination-Realm in its ABNF. The value of the
   Destination-Realm AVP MAY be extracted from the User-Name AVP, or
   other application-specific methods.

   When a message is received, the message is processed in the following
   order:
      1. If the message is destined for the local host, the procedures
         listed in section 5.1 are followed.
      2. If the message is intended for a Diameter peer with whom the
         local host is able to directly communicate with, the procedures
         listed in section 5.2 are followed. This is known as Message
         Forwarding.
      3. The procedures listed in section 5.3 are followed, which is
         known as Message Routing.



Calhoun et al.           expires December 2001                 [Page 35]





Internet-Draft                                                 June 2001


      4. If none of the above are successful, an answer is returned with
         the Result-Code set to DIAMETER_UNABLE_TO_DELIVER.

   Note the processing rules contained in this section are intended to
   be used as general guidelines to Diameter developers. Certain
   implementations MAY use different methods than the ones described
   here, and still be in compliance with the protocol specification.


5.1  Processing Local Messages

   A request is known to be for local comsumption when one of the
   following conditions occur:
      - The Destination-Host AVP contains the local host's identity,
      - The Destination-Host AVP is not present, the Destination-Realm
        AVP contains a realm the server is configured to process
        locally, and the Diameter application is locally supported, or
      - The Destination-Realm AVP is not present.

   When a request is locally processed, the following procedures MUST be
   applied, in addition to any additional procedures that MAY be
   discussed in the Diameter application defining the command:

      - The same Hop-by-Hop identifier in the request is used in the
        answer.
      - The local host's identity is encoded in the Origin-Host and
        Origin-Host AVPs.
      - The value of the Origin-Host AVP in the request is included in
        the answer's Destination-Host AVP.
      - The Result-Code AVP is added with its value indicating success
        or failure.
      - If the Session-Id is present in the request, it MUST be included
        in the answer.
      - Any Route-Record or Proxy-Info AVPs in the request MUST be added
        to the answer message, in the same order they were present in
        the request.

   When the local message is an answer, no additional procedures beyond
   those listed in the specific Diameter application are to be followed.


5.2  Message Forwarding

   Message forwarding is done using the Diameter Peer Table. The
   Diameter peer table contains all of the peers that the local node is
   able to directly communicate with.

   When a request is received, and the host encoded in the Destination-



Calhoun et al.           expires December 2001                 [Page 36]





Internet-Draft                                                 June 2001


   Host AVP is one that is present in the peer table, the message SHOULD
   be forwarded to the peer.

   If the message received is an answer, the host in the Destination-
   Host AVP is in the peer table, and there are no Route-Record AVPs in
   the message, the message MUST be forwarded to the peer.


5.2.1  Peer Table

   The Diameter Peer Table is used in message forwarding, and referenced
   by the Domain Routing Table. A Peer Table entry contains the
   following fields:
      - Peer name. The Fully Qualified Domain Name of the peer. This MAY
        be resolved locally, or known via the CER or CEA message.
      - Port Number. The port number the peer may be contacted on.
      - Protocol. Specifies whether TCP or SCTP is the protocol to use
        to communicate with the peer.
      - TLS Enabled. Specifies whether TLS is to be used when
        communicating with the peer.


5.3  Message Routing

   Diameter request message routing is done via realms. A Diameter
   message that is proxyable MUST include the target realm in the
   Destination-Realm AVP. The realm MAY be retrieved from the User-Name
   AVP, which is in the form of a Network Access Identifier (NAI). The
   realm portion of the NAI is inserted in the Destination-Realm AVP.

   Diameter agents have a list of locally supported realms, and MAY have
   a list of externally supported realms. When a request is received
   that includes a realm that is not locally supported, the message is
   routed to the peer configured in the Domain Routing Table table (see
   section 5.3.1).


5.3.1  Realm-Based Routing Table

   All Realm-Based routing lookups are performed against what is
   commonly known as the Domain Routing Table (see section 16.0). A
   Domain Routing Table Entry contains the following fields:
      - Domain Name. The Domain Name is analogous to the realm portion
        of the NAI.  This is the field that is typically used as a
        primary key in the routing table lookups. Note that some
        implementations perform their lookups based on longest-match-
        from-the-right on the realm rather than requiring an exact
        match.



Calhoun et al.           expires December 2001                 [Page 37]





Internet-Draft                                                 June 2001


      - Application Identifier. It is possible for a routing entry to
        have a different destination based on the Acct-Application-Id
        (for accounting messages) or Auth-Application-Id (for non-
        accounting messages) of the message. This field is typically
        used as a secondary key field in routing table lookups.
      - Local Action. The Local Action field is used to identify how a
        message should be treated. The following actions are supported:
           1. LOCAL - Diameter messages that resolve to a routing entry
              with the Local Action set to Local can be satisfied
              locally, and do not need to be routed to another server.
           2. RELAY - All Diameter messages that fall within this
              category MUST be routed to a next hop server, without
              modifying any non-routing AVPs. See sections 5.3.3 and
              5.3.4 for relaying guidelines
           3. PROXY - All Diameter messages that fall within this
              category MUST be routed to a next hop server. The local
              server MAY apply its local policies to the message by
              including new AVPs to the message prior to routing.  See
              sections 5.3.3 and 5.3.4 for relaying guidelines.
           4. REDIRECT - Diameter messages that fall within this
              category MUST have the identity of the home Diameter
              server(s) appended, and returned to the sender of the
              message. See section 5.3.2 for redirect guidelines.
      - Server Identifier - One or more servers the message is to be
        routed to.  These servers MUST also be present in the Peer
        table. When the Local Action is set to RELAY or PROXY, this
        field contains the identity of the server(s) the message must be
        routed to. When the Local Action field is set to REDIRECT, this
        field contains the identity of one or more servers the message
        should be redirected to.

   It is important to note that Diameter agents MUST support at least
   one of the LOCAL, RELAY, PROXY or REDIRECT modes of operation. Agents
   do not need to support all modes of operation in order to conform
   with the protocol specification, but MUST follow the protocol
   compliance guidelines in section 2.0. Relay agents MUST NOT reorder
   AVPs, and proxies SHOULD NOT reorder AVPs.

   When a request is routed, the target server MUST have advertised the
   Application Identifier (see section 6.1) for the given message, or
   have advertised itself as a relay or proxy agent.


5.3.2  Redirecting requests

   When a redirector agent receives a request whose routing entry is set
   to REDIRECT, it MUST answer the request with Message-Reject-Answer,
   while maintaining the Hop-by-Hop Identifier in the header, and



Calhoun et al.           expires December 2001                 [Page 38]





Internet-Draft                                                 June 2001


   include the Result-Code AVP to DIAMETER_REDIRECT_INDICATION. Each of
   the servers associated with the routing entry are added in separate
   Redirect-Host AVP.

                     +------------------+
                     |     Diameter     |
                     | Redirector Agent |
                     +------------------+
                      ^    |
           1. Request |    | 2. MRA +
          joe@xyz.com |    | Result-Code = DIAMETER_REDIRECT_INDICATION +
                      |    | Redirect-Host AVP(s)
                      |    v
                    +---------+  3. Request  +----------+
                    | abc.net |------------->| xyz.net  |
                    |  Relay  |              | Diameter |
                    |  Agent  |<-------------|  Server  |
                    +---------+  4. Answer   +----------+
                    Figure 7: Diameter Redirect Server

   Redirector agents MAY also include the certificate of the servers in
   the Redirect-Host AVP(s). These certificates are encapsulated in a
   CMS-Cert AVP [11].

   The receiver of the MRA message with the Result-Code AVP set to
   DIAMETER_REDIRECT_INDICATION uses the hop-by-hop field in the
   Diameter header to identify the request in the pending message queue
   (see Section 7.3) that is to be redirected. If no transport
   connection exists with the new agent, one is created, and the request
   is sent directly to it.


5.3.3  Relaying and Proxying Requests

   A relay or proxy agent MUST check for forwarding loops before
   forwarding requests. A loop is detected if the server finds its own
   address in a Route-Record AVP. When such an event occurs, the agent
   MUST answer with the Result-Code AVP set to DIAMETER_LOOP_DETECTED.

   A relay or proxy agent MUST append a Route-Record AVP that includes
   its identity to all requests forwarded. The last Route-Record AVP in
   all requests received MUST be validated, by ensuring that the host
   encoded in the AVP is the same as the peer the message was received
   from.

   The Hop-by-Hop identifier in the request is saved, and replaced with
   a locally unique value.




Calhoun et al.           expires December 2001                 [Page 39]





Internet-Draft                                                 June 2001


   Relay and Proxy agents MAY include the Proxy-Info AVP in requests if
   it requires access any local state information when the corresponding
   response is received. Alternatively, it MAY simply use local storage
   to store state information.

   The message is then forwarded to the next hop, as identified in the
   Domain Routing Table.

   Figure 6 provides an example of message routing using the procedures
   listed in these sections.

          (Origin-Host=nas.mno.net)    (Origin-Host=nas.mno.net)
          (Origin-Realm=mno.net)       (Origin-Realm=mno.net)
          (Destination-Realm=abc.com)  (Destination-Realm=abc.com)
                                       (Route-Record=drl.mno.net)
      +------+      ------>      +------+      ------>      +------+
      |      |     (Request)     |      |      (Request)    |      |
      | NAS  +-------------------+ DRL  +-------------------+ HMS  |
      |      |                   |      |                   |      |
      +------+      <------      +------+      <------      +------+
      mno.net      (Answer)      mno.net       (Answer)     abc.com
          (Origin-Host=hms.abc.com)   (Origin-Host=hms.abc.com)
          (Origin-Realm=abc.com)      (Origin-Realm=abc.com)
      (Destination-Host=nas.mno.net)  (Destination-Host=nas.mno.net)
                                      (Route-Record=drl.mno.net)
                  Figure 6: Routing of Diameter messages


5.3.4  Relaying and Proxying Answers

   A relay or proxy agent MUST only process Answers whose last Route-
   Record AVP matches one of its identities. Any answers that do not
   conform to this rule MUST be dropped. The last Route-Record AVP MUST
   be removed from the message before it is forwarded to the next hop,
   which is identified by the second to last Route-Record AVP.

   If the last Proxy-Info AVP in the message is targeted to the local
   Diameter server, the AVP MUST be removed.

   If a relay or proxy agent receives an answer with a Result-Code AVP
   indicating a failure, it MUST NOT modify the contents of the AVP. Any
   additional local errors detected SHOULD be logged, but not reflected
   in the Result-Code AVP. If the agent receives an answer message with
   a Result-Code AVP indicating success, and it wishes to modify the AVP
   to indicate an error, it MUST issue an STR on behalf of the access
   device.

   Prior to forwarding the answer, the agent MUST restore the original



Calhoun et al.           expires December 2001                 [Page 40]





Internet-Draft                                                 June 2001


   value of the Diameter header's Hop-by-Hop Identifier field.


5.3.5  Hiding Network Topology

   A Relay or Proxy agent routing messages outside of their
   administrative domain MAY need to hide the internal Diameter
   topology. This is done by removing all Route-Record AVPs in a
   request, and later adding them back into the corresponding answer, in
   the same order. Such agents MUST take care to not assume that the
   absence of any Route-Record AVPs implies the message is for local
   comsumption.


5.4  Origin-Host AVP

   The Origin-Host AVP (AVP Code 264) is of type OctetString, encoded in
   the UTF-8 [24] format, according to the Diameter identity rules
   defined in section 2.7, and MUST be present in all Diameter messages.
   This AVP identifies the endpoint which originated the Diameter
   message, i.e. the access device, home server, or broker. Relay agents
   MUST NOT modify this AVP.

   Note that the Origin-Host AVP may resolve to more than one address as
   the Diameter peer may support more than one address.

   This AVP SHOULD be placed as close to the Diameter header as
   possible.


5.5  Origin-Realm AVP

   The Origin-Realm AVP (AVP Code 296) is of type OctetString, encoded
   in the UTF-8 [24] format. This AVP contains the Realm of the
   originator of any Diameter message and MUST be present in all
   messages

   This AVP SHOULD be placed as close to the Diameter header as
   possible.


5.6  Destination-Host AVP

   The Destination-Host AVP (AVP Code 293) is of type OctetString,
   encoded in the UTF-8 [24] format, according to the Diameter identity
   rules defined in section 2.7. This AVP MUST be present in all
   unsolicited agent initiated messages, MAY be present in request
   messages, and MUST be present in Answer messages. The value of the



Calhoun et al.           expires December 2001                 [Page 41]





Internet-Draft                                                 June 2001


   Destination-Host AVP is set to the value of the Origin-Host AVP found
   in a message from the intended target host.

   This AVP SHOULD be placed as close to the Diameter header as
   possible.


5.7  Destination-Realm AVP

   The Destination-Realm AVP (AVP Code 283) is of type OctetString,
   encoded in the UTF-8 [24] format, and contains the realm the message
   is to be routed to. The Destination-Realm AVP MUST NOT be present in
   Answer messages.  Diameter Clients insert the realm portion of the
   User-Name AVP. Diameter servers initiating a request message use the
   value of the Origin-Realm AVP from a previous message received from
   the intended target host (unless it is known a priori). When present,
   the Destination-Realm AVP is used to perform message routing
   decisions.

   Request messages whose ABNF does not list the Destination-Realm AVP
   as a mandatory AVP are inherently non-routable messages.

   This AVP SHOULD be placed as close to the Diameter header as
   possible.


5.8  Routing AVPs

   The AVPs defined in this section are Diameter AVPs used for routing
   purposes. These AVPs change as Diameter messages are processed by
   agents, and therefore MUST NOT be protected using the Diameter CMS
   Security application [11].


5.8.1  Route-Record AVP

   The Route-Record AVP (AVP Code 282) is of type OctetString, encoded
   in the UTF-8 [24] format, according to the Diameter identity rules
   defined in section 2.7. The identity added in this AVP MUST be the
   same as the identity sent in the Origin-Host of the Capabilities-
   Exchange-Request message.


5.8.2  Proxy-Info AVP

   The Proxy-Info AVP (AVP Code = 284) is of type Grouped.  The Grouped
   Data field has the following ABNF grammar:




Calhoun et al.           expires December 2001                 [Page 42]





Internet-Draft                                                 June 2001


      Proxy-Info ::= < AVP Header: 284 >
                     { Proxy-Host }
                     { Proxy-State }
                   * [ AVP ]


5.8.3  Proxy-Host AVP

   The Proxy-Host AVP (AVP Code = 280) is of type OctetString, encoded
   in the UTF-8 [24] format, according to the Diameter identity rules
   defined in section 2.7. This AVP contains the identity of the host
   that added the Proxy-Info AVP.


5.8.4  Proxy-State AVP

   The Proxy-State AVP (AVP Code = 33) is of type OctetString, and
   contains state local information, and MUST be treated as opaque data.


5.9  Redirect-Host AVP

   The Redirect-Host AVP (AVP Code 292) is of type OctetString, encoded
   in the UTF-8 [24] format, according to the Diameter identity rules
   defined in section 2.7. This AVP MUST be present in Message-Reject-
   Answer messages that include the Result-Code AVP set to
   DIAMETER_REDIRECT_INDICATION.

   Upon receiving the above, the receiving Diameter node SHOULD forward
   the request directly to the host identified in this AVP.


6.0  Capabilities Exchange

   When two Diameter peers establish a transport connection, they MUST
   exchange the Device Reboot messages, as specified in the peer state
   machine (see section 8.0). This message has two purposes. First it
   allows a peer's identity to be discovered, and allows for
   capabilities exchange, such as the supported protocol version number,
   the locally supported Diameter applications, etc.

   The receiver only issues commands to its peers that have advertised
   support for the Diameter application that defines the command. A
   Diameter node MUST cache the supported applications in order to
   ensure that unrecognized commands and/or AVPs are not unnecessarily
   sent to a peer.

   A receiver of a Capabilities-Exchange-Req message which does not have



Calhoun et al.           expires December 2001                 [Page 43]





Internet-Draft                                                 June 2001


   any applications in common with the sender MUST return a
   Capabilities-Exchange-Answer with the Result-Code AVP set to
   DIAMETER_NO_COMMON_APPLICATION, and SHOULD disconnect the transport
   layer connection.

   The Capabilities-Exchange-Request and Capabilities-Exchange-Answer
   messages MUST NOT be proxied, or redirected.

   Since the CER/CEA messages cannot be proxied, it is still possible
   that an upstream proxy receives a message for which it has no
   available peers to handle the application that corresponds to the
   Command-Code. In such instances, the Message-Reject-Answer message is
   used (see Section 9.2.1) to inform the downstream to take action
   (e.g. re-routing request to an alternate peer).

   With the exception of the Capabilities-Exchange-Request message, a
   message of type Request that includes the Auth-Application-Id or
   Acct-Application-Id AVPs, or a message with an application-specific
   command code, MAY only be forwarded to a host that has explicitly
   advertised support for the application (or has advertised the Relay
   Application Identifier).


6.1  Application Identifiers

   Each Diameter application MUST have an IANA assigned Application
   Identifier (see section 15.3). The base protocol does not require an
   application Identifier since its support is mandatory.

   Application Identifiers are communicated via two separate AVPs;
   Auth-Application-Id and Acct-Application-Id. The Auth-Application-Id
   AVP is used to communicate support for the authentication and
   authorization portion of an application. The Acct-Application-Id AVP,
   on the other hand, communicates support for the accounting portion of
   an application.

   This separation of AVPs allows a server to communicate that it is
   willing to accept only accounting messages for a given application.

   The following Application Identifier values are defined:

      NASREQ               1 [7]
      End-to-End Security  2 [11]
      Mobile-IP            4 [10]
      Relay                0xffffffff

   Relay and redirect agents MUST advertise the Proxy application
   identifier, while all other Diameter nodes MUST advertise locally



Calhoun et al.           expires December 2001                 [Page 44]





Internet-Draft                                                 June 2001


   supported applications. The receiver of a Device Reboot message
   advertising Relay service MUST assume that the sender supports all
   current and future applications.

   Diameter relay and proxy agents are responsible for finding a
   downstream server that supports the application of a particular
   message. If none can be found, a MRA message is returned with the
   Result-Code AVP set to DIAMETER_UNABLE_TO_DELIVER.


6.2  Capabilities-Exchange-Request

   The Capabilities-Exchange-Request (CER), indicated by the Command-
   Code set to 257 and the Command Flags' 'R' bit set, is sent to inform
   a peer that a reboot has occurred.

   When Diameter is run over SCTP [26], which allows for connections to
   span multiple interfaces, hence multiple IP addresses, the
   Capabilities-Exchange-Request message MUST contain one Host-IP-
   Address AVP for each potential IP address that MAY be locally used
   when transmitting Diameter messages.

   Message Format

      <Capabilities-Exchange-Req> ::= < Diameter Header: 257, REQUEST >
                                      { Origin-Host }
                                      { Origin-Realm }
                                   1* { Host-IP-Address }
                                      { Vendor-Id }
                                      { Product-Name }
                                      [ Origin-State-Id ]
                                    * [ Supported-Vendor-Id ]
                                    * [ Auth-Application-Id ]
                                    * [ Acct-Application-Id ]
                                      [ Destination-Host ]
                                      [ Firmware-Revision ]
                                    * [ AVP ]


6.3  Capabilities-Exchange-Answer

   The Capabilities-Exchange-Request (CEA), indicated by the Command-
   Code set to 257 and the Command Flags' 'R' bit cleared, is sent in
   response to a CER message.

   When Diameter is run over SCTP [26], which allows for connections to
   span multiple interfaces, hence multiple IP addresses, the
   Capabilities-Exchange-Answer message MUST contain one Host-IP-Address



Calhoun et al.           expires December 2001                 [Page 45]





Internet-Draft                                                 June 2001


   AVP for each potential IP address that MAY be locally used when
   transmitting Diameter messages.

   Message Format

      <Capabilities-Exchange-Answer> ::= < Diameter Header: 257 >
                                         { Result-Code AVP }
                                         { Origin-Host }
                                         { Origin-Realm }
                                      1* { Host-IP-Address }
                                         { Vendor-Id }
                                         { Product-Name }
                                         [ Origin-State-Id ]
                                       * [ Supported-Vendor-Id ]
                                       * [ Auth-Application-Id ]
                                       * [ Acct-Application-Id ]
                                         [ Destination-Host ]
                                         [ Firmware-Revision ]
                                       * [ AVP ]


6.4  Vendor-Id AVP

   The Vendor-Id AVP (AVP Code 266) is of type Unsigned32 and contains
   the IANA "SMI Network Management Private Enterprise Codes" [2] value
   assigned to the vendor of the Diameter device.

   In combination with the Supported-Vendor-Id AVP (section 6.8), this
   MAY be used in order to know which vendor specific attributes may be
   sent to the peer. It is also envisioned that the combination of the
   Vendor-Id, Product-Name (section 6.9) and the Firmware-Revision
   (section 6.5) AVPs MAY provide very useful debugging information.

   A Vendor-Id value of zero in the CER or CEA messages is reserved and
   indicates that the Diameter peer is in the experimental or concept
   stage and that an IANA Private Enterprise Number has yet to be
   obtained by the implementor.


6.5  Firmware-Revision AVP

   The Firmware-Revision AVP (AVP Code 267) is of type Unsigned32 and is
   used to inform a Diameter peer of the firmware revision of the
   issuing device.

   For devices that do not have a firmware revision (general purpose
   computers running Diameter software modules, for instance), the
   revision of the Diameter software module may be reported instead.



Calhoun et al.           expires December 2001                 [Page 46]





Internet-Draft                                                 June 2001


6.6  Auth-Application-Id AVP

   The Auth-Application-Id AVP (AVP Code 258) is of type Unsigned32 and
   is used in order to advertise support of the Authentication and
   Authorization portion of an application (see Section 6.1). The Auth-
   Application-Id MUST also be present in all Authentication and/or
   Authorization messages that are defined in a separate Diameter
   specification and have an Application ID assigned.

   This AVP SHOULD be placed as close to the Diameter header as
   possible.


6.7  Host-IP-Address AVP

   The Host-IP-Address AVP (AVP Code 257) is of type Address and is used
   to inform a Diameter peer of the sender's IP address.  All source
   addresses that a Diameter node expects to use with SCTP [26] MUST be
   advertised in the CER and CEA messages by including a Host-IP-Address
   AVP for each address. This AVP MUST ONLY be used in the CER and CEA
   messages.


6.8  Supported-Vendor-Id AVP

   The Supported-Vendor-Id AVP (AVP Code 265) is of type Unsigned32 and
   contains the IANA "SMI Network Management Private Enterprise Codes"
   [2] value assigned to a vendor other than the device vendor. This is
   used in the CER and CEA messages in order to inform the peer that the
   sender supports a subset of the vendor-specific commands and/or AVPs
   defined by the vendor identified in this AVP.


6.9  Product-Name AVP

   The Product-Name AVP (AVP Code 269) is of type OctetString, encoded
   in the UTF-8 [24] format, and contains the vendor assigned name for
   the product. The Product-Name AVP SHOULD remain constant across
   firmware revisions for the same product.


6.10  Acct-Application-Id AVP

   The Acct-application-Id AVP (AVP Code 259) is of type Unsigned32 and
   is used in order to advertise support of the Accounting portion of an
   application (see Section 6.1). The Acct-Application-Id MUST also be
   present in all Accounting messages that are defined in a separate
   Diameter specification and have an Application ID assigned.



Calhoun et al.           expires December 2001                 [Page 47]





Internet-Draft                                                 June 2001


   This AVP SHOULD be placed as close to the Diameter header as
   possible.


6.11  Vendor-Specific-Application-Id AVP

   The Vendor-Specific-Application-Id AVP (AVP Code 260) is of type
   Grouped and is used to advertise support of a vendor-specific
   Diameter Application. Either the Auth-Application-Id or the Acct-
   Application-Id AVP MAY be present. Both AVPs MAY be present if they
   both contain the same value.

   This AVP MUST also be present in all vendor-specific commands defined
   in the vendor-specific application.

   This AVP SHOULD be placed as close to the Diameter header as
   possible.

   AVP Format

      <Vendor-Specific-Application-Id> ::= < AVP Header: 260 >
                                        1* [ Vendor-Id ]
                                        0*1{ Auth-Application-Id }
                                        0*1{ Acct-Application-Id }


7.0  Transport Failure Detection

   Given the nature of the Diameter protocol, it is recommended that
   transport failures be detected as soon as possible. Detecting such
   failures will minimize the occurrence of messages sent to unavailable
   servers, resulting in unnecessary delays, and will provide better
   failover performance.  The Device-Watchdog-Request and Device-
   Watchdog-Answer messages, defined in this section, are used to pro-
   actively detect transport failures.

   The watchdog behavior is controlled by the Tw timer, which ranges
   between 30 and 60 seconds. In order to avoid synchronization
   behaviors that can occur with fixed timers among distributed systems,
   each time the watchdog interval is calculated with a jitter by using
   the Tw value (which defaults to 30 seconds) and randomly adding or
   subtracting a random value drawn between 0.5 and 2 seconds.
   Alternative calculations to create jitter MAY be used. These MUST be
   pseudo-random and not cyclic.

   When a response is received, Tw is reset. Receiving a watchdog from a
   peer constitutes activity, and Tw should be reset.  On sending a
   message, if the queue is empty, then Tw is reset. If the watchdog



Calhoun et al.           expires December 2001                 [Page 48]





Internet-Draft                                                 June 2001


   timer expires and the queue is empty, then a watchdog packet is sent.


7.1  Device-Watchdog-Request

   The Device-Watchdog-Request (DWR), indicated by the Command-Code set
   to 280 and the Command Flags' 'R' bit set, is sent to a peer when no
   traffic has been exchanged between two peers as defined in Section
   7.0, and no requests are pending with the peer.

   Message Format

      <Device-Watchdog-Request>  ::= < Diameter Header: 280, REQUEST >
                                     { Origin-Host }
                                     { Origin-Realm }
                                     { Destination-Host }


7.2  Device-Watchdog-Answer

   The Device-Watchdog-Answer (DWA), indicated by the Command-Code set
   to 280 and the Command Flags' 'R' bit cleared, is sent as a response
   to the Device-Watchdog-Request message. A receiver of the DWA SHOULD
   perform RTT calculation in the event that the transport RTO
   information is not available.

   Message Format

      <Device-Watchdog-Answer>  ::= < Diameter Header: 280 >
                                    { Result-Code }
                                    { Origin-Host }
                                    { Origin-Realm }
                                    { Destination-Host }


7.3  Failover/Failback Procedures

   In the event that a transport failure is detected with a peer, it is
   necessary for all pending request messages to be forwarded to an
   alternate agent, if possible. This is commonly referred to as
   failover.

   In order for a Diameter node to perform failover procedures, it is
   necessary for the node to maintain a pending message queue for a
   given peer. When an answer message is received, the corresponding
   request is removed from the queue. The Hop-by-Hop Identifier field
   MAY be used to match the answer with the queued request.




Calhoun et al.           expires December 2001                 [Page 49]





Internet-Draft                                                 June 2001


   When a transport failure is detected, all messages in the queue are
   sent to an alternate agent, if possible. An example of a case where
   it is not possible for forward the message to an alternate server is
   when the message has a fixed destination, and the unavailable peer is
   the message's final destination (see Destination-Host AVP). Such an
   error requires that the agent return an MRA with the Result-Code AVP
   set to DIAMETER_UNABLE_TO_DELIVER.

   It is important to note that multiple identical request or answer MAY
   be received as a result of a failover. The End-to-End Identifier
   field in the Diameter header along with the Origin-Host AVP MUST be
   used to identify duplicate messages.

   As described in section 2.1, a connection request should be
   periodically attempted with the failed peer in order to re-establish
   the transport connection. Once a connection has been successfully
   established, messages can once again be forwarded to the peer. This
   is commonly referred to as failback.


8.0  Peer State Machine

   This section contains a finite state machine, that MUST be observed
   by all Diameter implementations. Each Diameter node MUST follow the
   state machine described below when communicating with each peer.
   Multiple actions are separated by commas, and may continue on
   succeeding lines as space requires. Similarly, state and next state
   may also span multiple lines as space requires.

   There may be at most one transport connection between any two peers
   over which Diameter messages may be passed. This state machine is
   intended to handle both the simple case, in which one peer initiates
   a connection to the other, and the complex case, in which each peer
   simultaneously initiates a connection to the other. In the complex
   case, an election occurs to determine which transport connection will
   survive.

   I- is used to represent the initiator (connecting) connection, while
   the R- is used to represent the responder (listening) connection. The
   lack of a prefix indicates that the event or action is the same
   regardless of the connection on which the event occurred.

   The stable states that a state machine may be in are Closed, I-Open
   and R-Open; all other states are intermediate. Note that I-Open and
   R-Open are equivalent except for whether the initiator or responder
   transport connection is used for communication.

   A CER message is always sent on the initiating connection immediately



Calhoun et al.           expires December 2001                 [Page 50]





Internet-Draft                                                 June 2001


   after the connection request is successfully completed.  The non-
   elected connection will close down. All subsequent messages are sent
   on the elected connection.

   The state machine constrains only the behavior of a Diameter
   implementation as seen by Diameter peers through events on the wire.
   Any implementation that produces equivalent results is considered
   compliant.

      state            event              action         next state
      -----------------------------------------------------------------
      Closed           Start            I-Snd-Conn-Req   Wait-Conn-Ack
                       R-Rcv-Conn-Req   R-Snd-Conn-Ack   Wait-R-CER

      Wait-Conn-Ack    I-Rcv-Conn-Ack   I-Snd-CER        Wait-I-CEA
                       I-Rcv-Conn-Nack  Cleanup          Closed
                       R-Rcv-Conn-Req   R-Snd-Conn-Ack   Wait-Conn-Ack/
                                                         Wait-R-CER
                       Timeout          Error            Closed

      Wait-I-CEA       I-Rcv-CEA        Process-CEA      I-Open
                       R-Rcv-Conn-Req   R-Snd-Conn-Ack   Wait-R-CER/
                                                         Elect
                       I-Peer-Disc      I-Disc           Closed
                       Timeout          Error            Closed

      Wait-Conn-Ack/   I-Rcv-Conn-Ack   I-Snd-CER        Wait-R-CER/
      Wait-R-CER                                         Elect
                       I-Rcv-Conn-Nack  Cleanup          Wait-R-CER
                       R-Rcv-CER        Process-CER      Wait-Conn-Ack/
                                                         Elect
                       Timeout          Error            Closed

      Wait-R-CER/      R-Rcv-CER        Process-CER,     Wait-Returns
      Elect                             Elect
                       I-Peer-Disc      I-Disc           Wait-R-CER
                       Timeout          Error            Closed

      Wait-Conn-Ack/   I-Rcv-Conn-Ack   I-Snd-CER,Elect  Wait-Returns
      Elect            I-Rcv-Conn-Nack  R-Snd-CEA        R-Open
                       R-Peer-Disc      R-Disc           Wait-Conn-Ack-2
                       Timeout          Error            Closed

      Wait-Returns     Win-Election     I-Disc,R-Snd-CEA R-Open
                       I-Peer-Disc      I-Disc,R-Snd-CEA R-Open
                       I-Rcv-CEA        R-Disc           I-Open
                       R-Peer-Disc      R-Disc           Wait-I-CEA-2
                       Timeout          Error            Closed



Calhoun et al.           expires December 2001                 [Page 51]





Internet-Draft                                                 June 2001


      Wait-Conn-Ack-2  I-Rcv-Conn-Ack   I-Snd-CER        Wait-I-CEA-2
                       I-Rcv-Conn-Nack  Cleanup          Closed
                       R-Rcv-Conn-Req   R-Disc           Wait-Conn-Ack-2
                       Timeout          Error            Closed

      Wait-I-CEA-2     I-Rcv-CEA        Process-CEA      I-Open
                       I-Peer-Disc      I-Disc           Closed
                       R-Rcv-Conn-Req   R-Disc           Wait-I-CEA-2
                       Timeout          Error            Closed

      Wait-R-CER       R-Rcv-CER        Process_CER,     R-Open
                                        R-Snd-CEA
                       Timeout          Error            Closed

      R-Open           Send-Message     R-Snd-Non-DRI    R-Open
                       R-Rcv-Non-DRI    Process          R-Open
                       R-WatchDog-Timer R-Snd-DWR        R-Open
                       R-Rcv-DWA        Process-DWA      R-Open
                       Stop             R-Snd-Disc       Closed
                       R-Peer-Disc      R-Disc           Closed
                       R-Rcv-CER        Error            Closed

      I-Open           Send-Message     I-Snd-Non-DRI    I-Open
                       I-Rcv-Non-DRI    Process          I-Open
                       I-WatchDog-Timer I-Snd-DWR        I-Open
                       I-Rcv-DWA        Process-DWA      I-Open
                       Stop             I-Disc           Closed
                       I-Peer-Disc      I-Disc           Closed
                       I-Rcv-DRI        Error            Closed
                       R-Rcv-Conn-Req   R-Disc           I-Open


8.1  States

   Following is a more detailed description of each automaton state.

      Closed         A peer is initially in the closed state, and no
                     transport connection exists with the peer.

      Wait-Conn-Ack  A transport connection has been initiated with the
                     peer, and an acknowledgement is pending.

      Wait-I-CEA     The local Diameter node is waiting for the peer to
                     issue a DRI.

      Wait-Conn-Ack/Wait-R-CER
                     A transport connection indication from the peer was
                     received, while a transport connection has already



Calhoun et al.           expires December 2001                 [Page 52]





Internet-Draft                                                 June 2001


                     been locally initiated.

      Wait-R-CER/Elect
                     Two transport connections have been established
                     with the peer, and a DRI is pending on the
                     responder connection.

      Wait-Conn-Ack/Elect
                     A transport connection exists on the responder
                     connection, while an acknowledgment has yet to be
                     received on the initiator connection.

      Wait-Returns   Multiple transport connections caused an election
                     to occur.

      Wait-Conn-Ack-2
                     While an acknowledgement to a locally initiated
                     transport connection hasn't been received, an
                     election has failed and the initiator connection
                     will be used between the peers.

      Wait-I-CEA-2   Following an election, the initiator connection
                     won, and a DRI has yet to be received by the peer.

      Wait-R-CER     A transport connection indication has been received
                     from the peer, and a DRI has yet to be received by
                     the peer.

      R-Open         The responder connection will be used to
                     communicate with the peer.

      I-Open         The initiator connection will be used to
                     communicate with the peer.


8.2  Events

   Transitions and actions in the automaton are caused by events. In
   this section we will ignore the -I and -R prefix, since the actual
   event would be identical, but would occur on one of two possible
   connections.

      Start          The Diameter application has signaled that a
                     connection should be initiated with the peer.

      Rcv-Conn-Req   A transport connection indication from the peer has
                     been received.




Calhoun et al.           expires December 2001                 [Page 53]





Internet-Draft                                                 June 2001


      Rcv-Conn-Ack   A positive acknowledgement was received to a
                     locally initiated transport connection.

      Rcv-Conn-Nack  A negative acknowledgement was received to a
                     locally initiated transport connection.

      Timeout        An application-defined timer has expired while
                     waiting for some event.

      Rcv-CER        A CER message from the peer was received.

      Rcv-CEA        A CEA message from the peer was received.

      Peer-Disc      A disconnection indication from the peer was
                     received.

      Win-Election   An election was held, and the local node was the
                     winner.

      Send-Message   A Non-DRI message is to be sent.

      Rcv-Non-DRI    A Non-DRI message was received.

      WatchDog-Timer The Watchdog timer expired, indicating that a DWR
                     message is to be sent to the peer.

      Rcv-DWA        A DWA message was received.

      Stop           The Diameter application has signaled that a
                     connection should be terminated (e.g., on system
                     shutdown).


8.3  Actions

   Actions in the automaton are caused by events and typically indicate
   the transmission of packets and/or an action to be taken on the
   connection. In this section we will ignore the -I and -R prefix,
   since the actual action would be identical, but would occur on one of
   two possible connections.

      Snd-Conn-Req   A transport connection is initiated with the peer.

      Snd-Conn-Ack   an acknowledgement is sent in response to a connect
                     request, confirming that the transport layer
                     connection is open.

      Snd-CER        A CER message is sent to the peer.



Calhoun et al.           expires December 2001                 [Page 54]





Internet-Draft                                                 June 2001


      Snd-CEA        A CEA message is sent to the peer.

      Cleanup        If necessary, the connection is shutdown, and any
                     local resources are freed.

      Error          The transport layer connection is disconnected,
                     either politely or abortively, in response to an
                     error condition. Local resources are freed.

      Process-CER    A received CER is processed.

      Process-CEA    A received CEA is processed.

      Disc           The transport layer connection is disconnected, and
                     local resources are freed.

      Elect          An election occurs (see Section 8.4 for more
                     information).

      Snd-Non-DRI    A non-DRI message is sent.

      Snd-DWR        A DWR message is sent.

      Process-DWA    The DWA message is serviced.

      Process        A non-DRI Diameter message is serviced.


8.4  The Election Process

   The election is performed on the responder. The responder compares
   the Origin-Host received in the DRI sent by its peer with its own
   Origin-Host (which it may or may not have actually sent). The
   transport layer connection with the higher value of Origin-Host is
   the one that survives. The comparison proceeds by considering the
   shorter OctetString to be null-padded to the length of the longer,
   then performing an octet by octet unsigned comparison with the first
   octet being most significant. Hanging octets are assumed to have
   value 0x80, but dimpled octets are ignored.


9.0  Error Handling

   There are two different types of errors in Diameter; protocol and
   applications. A protocol error is one that occurs at the base
   protocol level, and MAY require per hop attention (e.g. message
   routing error).  Application errors, on the other hand, are generally
   occur due to a problem with a function specified in a Diameter



Calhoun et al.           expires December 2001                 [Page 55]





Internet-Draft                                                 June 2001


   application (e.g. user authentication, Missing AVP).

   Result-Code AVP values that are used to report protocol errors MUST
   be used in the Message-Reject-Answer command. Unlike most Diameter
   commands, the Message-Reject-Answer does not have a corresponding
   request.

   When a request message is received that causes a protocol error, the
   command code is changed to Message-Reject-Answer, and the Result-Code
   AVP is set to the appropriate protocol error value. As the answer is
   sent back towards the originator of the request, each proxy or relay
   agent MAY take action on the message.

                    1. Request        +---------+ Link Broken
          +-------------------------->|Diameter |----///----+
          |     +---------------------|         |           v
   +------+--+  |      2. MRA         | Relay 2 |     +--------+
   |Diameter |<-+ (Unable to Forward) +---------+     |Diameter|
   |         |                                        |  Home  |
   | Relay 1 |--+                     +---------+     | Server |
   +---------+  |   3. Request        |Diameter |     +--------+
                +-------------------->|         |           ^
                                      | Relay 3 |-----------+
                                      +---------+
         Figure 4 - Example of Protocol Error causing MRA message

   Figure 4 provides an example of a message forwarded upstream by a
   Diameter relay. When the message is received by Relay 2, and it
   detects that it cannot forward the request to the home server, an MRA
   message is returned with the Result-Code AVP set to
   DIAMETER_UNABLE_TO_DELIVER. Given that this error falls within the
   protocol error category, Relay 1 would take special action, and given
   the error, attempt to route the message through its alternate Relay
   3.

   +---------+ 1. Request  +---------+ 2. Request  +---------+
   | Access  |------------>|Diameter |------------>|Diameter |
   |         |             |         |             |  Home   |
   | Device  |<------------|  Relay  |<------------| Server  |
   +---------+  4. Answer  +---------+  3. Answer  +---------+
              (Missing AVP)           (Missing AVP)
          Figure 5 - Example of Application Error Answer message

   Figure 5 provides an example of a Diameter message that caused an
   application error. When application errors occur, the Diameter entity
   reporting the error clears the 'R' bit in the Command Flags, and adds
   the Result-Code AVP with the proper value. Application errors do not
   require any proxy or relay agent involvement, and therefore the



Calhoun et al.           expires December 2001                 [Page 56]





Internet-Draft                                                 June 2001


   message would be forwarded back to the originator of the request.

   There are certain Result-Code AVP application errors that require
   additional AVPs to be present in the answer, such as:

      - An unrecognized AVP is received with the 'M' bit (Mandatory bit)
        set, causes an answer to be sent with the Result-Code AVP set to
        DIAMETER_AVP_UNSUPPORTED, and the Failed-AVP AVP containing the
        offending AVP.
      - An AVP that is received with an unrecognized value causes an
        answer to be returned with the Result-Code AVP set to
        DIAMETER_INVALID_AVP_VALUE, with the Failed-AVP AVP containing
        the AVP causing the error.
      - A command is received with an AVP that is ommitted, yet is
        mandatory according to the command's ABNF. The receiver issues
        an answer with the Result-Code set to DIAMETER_MISSING_AVP, and
        creates an AVP with the AVP Code and other fields set to the
        missing AVP's. The created AVP is then added to the Failed-AVP
        AVP.

   The Result-Code AVP contains additional errors conditions, and
   defines the expected behavior of each.


9.1  Result-Code AVP

   The Result-Code AVP (AVP Code 268) is of type Unsigned32 and
   indicates whether a particular request was completed successfully or
   whether an error occurred. All Diameter answer messages MUST include
   one Result-Code AVP. A non-successful Result-Code AVP (one containing
   a non 2xxx value) MUST include the Error-Reporting-Host AVP if the
   host setting the Result-Code AVP is different from the identity
   encoded in the Origin-Host AVP.

   The Result-Code data field contains an IANA-managed 32-bit address
   space representing errors (see section 15.4). Diameter provides the
   following classes of errors, all identified by the thousands digit:
      - 1xxx (Informational)
      - 2xxx (Success)
      - 3xxx (Protocol Errors)
      - 4xxx (Transient Failures)
      - 5xxx (Permanent Failure)

   A non-recognize class (one whose first digit is not defined in this
   section) MUST be handled as a permanent failure.


9.1.1  Informational



Calhoun et al.           expires December 2001                 [Page 57]





Internet-Draft                                                 June 2001


   Errors that fall within this category are used to inform the
   requester that a request could not be satisfied, and additional
   action is required on its part before access is granted.

      DIAMETER_MULTI_ROUND_AUTH         1001
         This informational error is returned by a Diameter server to
         inform the access device that the authentication mechanism
         being used required multiple round trip, and a subsequent
         request needs to be issued in order for access to be granted.


9.1.2  Success

   Errors that fall within the Success category are used to inform a
   peer that a request has been successfully completed.

      DIAMETER_SUCCESS                   2001
         The Request was successfully completed.


9.1.3  Protocol Errors

   Errors that fall within the Protocol Error category SHOULD be treated
   on a per-hop basis, and Diameter proxies MAY attempt to correct the
   error, if it is possible. Note that these errors MUST only be used in
   the Message-Rejected-Answer message, therefore a Diameter entity that
   wishes to return an error in this category MUST change the command
   code to Message-Rejected-Answer message.

      DIAMETER_INVALID_ROUTE_RECORD      3001
         The last Route-Record AVP in the message is not set to the
         identity of the sender of the message. See Section 11.0 for
         more information.

      DIAMETER_COMMAND_UNSUPPORTED       3002
         The Request contained a Command-Code that the receiver did not
         recognize or support.

      DIAMETER_UNABLE_TO_DELIVER         3003
         The request could not be delivered to a host that handles the
         realm, and application, requested at this time.

      DIAMETER_REALM_NOT_SERVED          3004
         The intended realm of the offending message is unknown.

      DIAMETER_TOO_BUSY                  3005
         When returned, a Diameter node SHOULD attempt to sent the
         message to an alternate peer.



Calhoun et al.           expires December 2001                 [Page 58]





Internet-Draft                                                 June 2001


      DIAMETER_INVALID_CMS_DATA          3006
         The Request did not contain a valid CMS-Data [11] AVP.

      DIAMETER_LOOP_DETECTED             3007
         An agent detected a loop while trying to get the message to the
         Home Diameter server. The message MAY be sent to an alternate
         peer, if one is available, but the peer reporting the error has
         identified a configuration problem.

      DIAMETER_END_2_END_SECURITY        3008
         A proxy has detected that end-to-end security has been applied
         to portions of the Diameter message, and the proxy does not
         allow this security mode since it needs to alter the message by
         applying some local policies.


9.1.4  Transient Failures

   Errors that fall within the transient failures category are used to
   inform a peer that the request could not be satisfied at the time it
   was received, but MAY be able to satisfy the request in the future.

      DIAMETER_AUTHENTICATION_REJECTED   4001
         The authentication process for the user failed, most likely due
         to an invalid password used by the user. Further attempts MUST
         only be tried after prompting the user for a new password.

      DIAMETER_OUT_OF_SPACE              4002
         A Diameter node received the accounting request but was unable
         to commit it to stable storage due to a temporary lack of
         space.


9.1.5  Permanent Failures

   Errors that fall within the permanent failures category are used to
   inform the peer that the request failed, and should not be attempted
   again.

      DIAMETER_USER_UNKNOWN              5001
         A request was received for a user that is unknown, therefore
         authentication and/or authorization failed.

      DIAMETER_AVP_UNSUPPORTED           5002
         The peer received a message that contained an AVP that is not
         recognized or supported and was marked with the Mandatory bit.
         A Diameter message with this error MUST contain one or more
         Failed-AVP AVP containing the AVPs that caused the failure.



Calhoun et al.           expires December 2001                 [Page 59]





Internet-Draft                                                 June 2001


      DIAMETER_UNKNOWN_SESSION_ID        5003
         The request contained an unknown Session-Id.

      DIAMETER_AUTHORIZATION_REJECTED    5004
         A request was received for which the user could not be
         authorized.  This error could occur if the service requested is
         not permitted to the user.

      DIAMETER_INVALID_AVP_VALUE         5005
         The request contained an AVP with an invalid value in its data
         portion. A Diameter message indicating this error MUST include
         the offending AVPs within a Failed-AVP AVP.

      DIAMETER_MISSING_AVP               5006
         The request did not contain an AVP that is required by the
         Command Code definition. If this value is sent in the Result-
         Code AVP, a Failed-AVP AVP SHOULD be included in the message.
         The data portion of the Failed-AVP MUST contain an AVP header
         containing the AVP Code and vendor-Id.

      DIAMETER_AUTHORIZATION_FAILED      5007
         A request was received for which the user could not be
         authorized at this time. This error could occur when the user
         has already expended allowed resources, or is only permitted to
         access services within a time period.

      DIAMETER_CONTRADICTING_AVPS        5008
         The Home Diameter server has detected AVPs in the request that
         contradicted each other, and is not willing to provide service
         to the user. One or more Failed-AVP AVPs MUST be present,
         containing the AVPs that contradicted each other.

      DIAMETER_AVP_NOT_ALLOWED           5009
         A message was received with an AVP that MUST NOT be present.
         The Failed-AVP AVP MUST be included and contain the AVP Code of
         the offending AVP.

      DIAMETER_AVP_OCCURS_TOO_MANY_TIMES 5010
         A message was received that included an AVP that appeared more
         often than permitted in the message definition. The Failed-AVP
         AVP MUST be included and contain the AVP Code of the offending
         AVP.

      DIAMETER_VENDOR_ID_UNSUPPORTED     5011
         The Home Diameter server has detected vendor-specific AVPs in
         the message, and the vendor dictionary is not supported. One or
         more Failed-AVP MUST be present, containing the offending AVPs.




Calhoun et al.           expires December 2001                 [Page 60]





Internet-Draft                                                 June 2001


      DIAMETER_UNSUPPORTED_TRANSFORM     5012
         A message was received that included an CMS-Data AVP [11] that
         made use of an unsupported transform.

      DIAMETER_NO_COMMON_APPLICATION     5013
         This error is returned when a CEA message is received, and
         there are no common applications supported between the peer.

      DIAMETER_UNSUPPORTED_VERSION       5014
         This error is returned when a CEA message is received, and the
         Diameter message is unsupported.

      DIAMETER_UNABLE_TO_COMPLY          5015
         This error is returned when a request is rejected for
         unspecified reasons.


9.2  Message-Reject-Answer

   The Message-Reject-Answer (MRA), indicated by the Command-Code set to
   282, and the Command Flags' 'R' bit cleared, is sent in response to a
   request that has caused a protocol error.

   Although the command code is different from the one found in the
   request, the same procedures used in issuing an answer message is
   followed. The Result-Code AVP MUST be present, and include a value in
   the "Protocol Error" category.

   Proxies receiving an MRA message MAY attempt to rectify the error
   reported, if possible. In the event that no proxy is able to correct
   the problem, the MRA will be returned to the originator of the
   request message.

   Message Format

      <Message-Reject-Answer> ::= < Diameter Header: 282 >
                                  < Session-Id >
                                  { Origin-Host }
                                  { Origin-Realm }
                                  { Result-Code }
                                  { Destination-Host }
                                  [ Origin-State-Id ]
                                * [ AVP ]


9.3  Error-Message AVP

   The Error-Message AVP (AVP Code 281) is of type OctetString.  It is a



Calhoun et al.           expires December 2001                 [Page 61]





Internet-Draft                                                 June 2001


   human readable UTF-8 character encoded string.  It MAY accompany a
   Result-Code AVP as a human readable error message. The Error-Message
   AVP is not intended to be useful in real-time, and SHOULD NOT be
   expected to be parsed by network entities.


9.4  Error-Reporting-Host AVP

   The Error-Reporting-Host AVP (AVP Code 294) is of type OctetString,
   encoded in the UTF-8 [24] format, according to the Diameter identity
   rules defined in section 2.7.  This AVP contains the identity of the
   Diameter host that set the Result-Code AVP to a value other than 2001
   (Success), only if the host setting the Result-Code is different from
   the one encoded in the Origin-Host AVP. This AVP is intended to be
   used for troubleshooting purposes, and MUST be set when the Result-
   Code AVP indicates a failure.


9.5 Failed-AVP AVP

   The Failed-AVP AVP (AVP Code 279) is of type Grouped and provides
   debugging information in cases where a request is rejected or not
   fully processed due to erroneous information in a specific AVP. The
   value of the Result-Code AVP will provide information on the reason
   for the Failed-AVP AVP.

   The possible reasons for this AVP are the presence of an improperly
   constructed AVP, an unsupported or unrecognized AVP, an invalid AVP
   value, the omission of a required AVP, the presence of an explicitly
   excluded AVP (see table 12.0), or the presence of two or more
   occurrences of an AVP which table 14.1 restricts to 0, 1, or 0-1
   occurrences.

   A Diameter message MAY contain one Failed-AVP AVP, containing the
   entire AVP that could not be processed successfully. If the failure
   reason is omission of a required AVP, an AVP with the missing AVP
   code, the missing vendor id, and a zero filled payload of the minimum
   required length for the ommitted AVP will be added.

   AVP Format

      <Failed-AVP> ::= < AVP Header: 279 >
                    1* {AVP}


10.0  "User" Sessions

   Diameter can provide two different type of services to applications.



Calhoun et al.           expires December 2001                 [Page 62]





Internet-Draft                                                 June 2001


   The first involves authentication and authorization, and can
   optionally make use of accounting. The second only makes use of
   accounting.

   When a service makes use of the authentication and/or authorization
   portion of an application, and a user requests access to the network,
   the Diameter client issues an auth request to its local server. The
   auth request is defined in a service specific Diameter application
   (e.g. NASREQ). The request contains a Session-Id AVP, which is used
   in subsequent messages (e.g. subsequent authorization, accounting,
   etc) relating to the user's session. The Session-Id AVP is a means
   for the client and servers to correlate a Diameter message with a
   user session.

   When a Diameter server authorizes a user to use network resources, it
   SHOULD add the Authorization-Lifetime AVP to the answer message. The
   Authorization-Lifetime AVP defines the maximum amount of time a user
   MAY make use of the resources before another authorization request is
   to be transmitted to the server. If the server does not receive
   another authorization request before the timeout occurs, it SHOULD
   release any state information related to the user's session. Note
   that the Authorization-Lifetime AVP implies how long the Diameter
   server is willing to pay for the services rendered, therefore a
   Diameter client SHOULD NOT expect payment for services rendered past
   the session expiration time.

   The base protocol does not include any authorization request
   messages, since these are largely application-specific and are
   defined in a Diameter application document. However, the base
   protocol does define a set of messages that are used to terminate
   user sessions. These are used to allow servers that maintain state
   information to free resources.

   When a service only makes use of the Accounting portion of the
   Diameter protocol, even in combination with an application, the
   Session-Id is still used to identify user sessions. However, the
   session termination messages are not used, since a session is
   signaled as being terminated by issuing an accounting stop message.


10.1  Authorization Session State Machine

   This section contains a finite state machine, representing the life
   cycle of Diameter sessions, and MUST be observed by all Diameter
   implementations that makes use of the authentication and/or
   authorization portion of a Diameter application. The term Service-
   Specific below refers to a message defined in a Diameter application
   (e.g. Mobile IP, NASREQ).



Calhoun et al.           expires December 2001                 [Page 63]





Internet-Draft                                                 June 2001


   The following table contains the authorization session state machine.

      State     Event                          Action     New State
      -------------------------------------------------------------
      Idle      Client or Device Requests      send       Pending
                access                         service
                                               specific
                                               auth req

      Idle      Service-Specific authorization send serv. Open
                request received, and          specific
                successfully processed         answer

      Pending   Successful Service-Specific    Grant      Open
                Authorization answer           Access
                received

      Pending   Successful Service-Specific    Sent STR   Discon
                authorization answer received
                but service not provided

      Pending   Error processing successful    Sent STR   Discon
                Service-Specific authorization
                answer

      Open      Authorization-Lifetime about   send       Open
                to expire on access device     service
                                               specific
                                               auth req

      Open      Successful Service-Specific    Extend     Open
                Authorization answer           Access
                received

      Open      Accounting message sent or     process    Open
                received

      Open      Failed Service-Specific        Discon.    Closed
                Authorization answer           user/device
                received.

      Open      Session-Timeout Expires on     send STR   Discon
                Access Device

      Open      SKR Received                   send SKA,  Discon
                                               STR

      Open      Session-Timeout or             Cleanup    Discon



Calhoun et al.           expires December 2001                 [Page 64]





Internet-Draft                                                 June 2001


                Authorization-Lifetime
                expires on home AAA server

      Open      SKA Received                   Cleanup    Closed

      Discon    SKR Received                   ignore     Discon

      Discon    STR Received                   Send STA   Closed

      Discon    STA Received                   Discon.    Closed
                                               user/device

      Closed    Transition to state            Cleanup

   When the Cleanup action is invoked, the Diameter node MAY attempt to
   release all resources for the particular session. Any event not
   listed above MUST be considered as an error condition, and an answer,
   if applicable, MUST be returned to the originator of the message.


10.2  Accounting Session State Machine

   For applications that only require accounting services, the following
   state machine MUST be supported.



























Calhoun et al.           expires December 2001                 [Page 65]





Internet-Draft                                                 June 2001


      State     Event                          Action     New State
      -------------------------------------------------------------
      Idle      Client or device requests      send       Pending
                access                         accounting
                                               start req.

      Idle      Accounting start request       send       Open
                received, and successfully     accounting
                processed.                     start
                                               answer

      Pending   Successful accounting          grant      Open
                start answer received          access

      Open      Receive Interim Record         send       Open
                                               accounting
                                               answer

      Open      User service terminated        send       Discon
                                               accounting
                                               stop req.

      Open      Accounting stop request        send       Closed
                received, and successfully     accounting
                processed                      stop answer

      Discon    Successful accounting          discon.    Closed
                stop answer received           user/device


10.3  Session-Id AVP

   The Session-Id AVP (AVP Code 263) is of type OctetString and is used
   to identify a specific session (see section 10.0). The Session-Id
   data uses the UTF-8 [24] character set. All messages pertaining to a
   specific session MUST include only one Session-Id AVP and the same
   value MUST be used throughout the life of a session. When present,
   the Session-Id SHOULD appear immediately following the Diameter
   Header (see section 3.0).

   For messages that do not pertain to a specific session, multiple
   Session-Id AVPs MAY be present as long as they are encapsulated
   within an AVP of type Grouped.

   The Session-Id MUST be globally and eternally unique, as it is meant
   to uniquely identify a user session without reference to any other
   information, and may be needed to correlate historical authentication
   information with accounting information. The Session-Id includes a



Calhoun et al.           expires December 2001                 [Page 66]





Internet-Draft                                                 June 2001


   mandatory portion and an implementation-defined portion; a
   recommended format for the implementation-defined portion is outlined
   below.

   The Session-Id MUST begin with the sender's identity (see section
   2.7).  The remainder of the Session-Id MAY be any sequence that the
   client can guarantee to be eternally unique; however, the following
   format is recommended, (square brackets [] indicate an optional
   element):

   <client FQDN>[:<port>];<high 32 bits>;<low 32 bits>[;<optional
   value>]

   <high 32 bits> and <low 32 bits> are decimal representations of the
   high and low 32 bits of a monotonically increasing 64-bit value. The
   64-bit value is rendered in two part to simplify formatting by 32-bit
   processors. At startup, the high 32 bits of the 64-bit value MAY be
   initialized to the time, and the low 32 bits MAY be initialized to 0.
   This will for practical purposes eliminate the possibility of
   overlapping Session-Ids after a reboot, assuming the reboot process
   takes longer than a second. Alternatively, an implementation MAY keep
   track of the increasing value in non-volatile memory.

   <optional value> is implementation specific but may include a modem's
   device Id, a layer 2 address, timestamp, etc.

   Example, in which the standard port is used and there is no optional
   value:

   accesspoint7.acme.com;1876543210;523

   Example, in which a non-standard port is used and there is an
   optional value:

   accesspoint7.acme.com:831;1876543210;523;mobile@200.1.1.88

   The session Id is created by the Diameter device initiating the
   session, which in most cases is done by the client. Note that a
   Session-Id MAY be used for both the authorization and accounting
   commands of a given application.


10.4  Authorization-Lifetime AVP

   The Authorization-Lifetime AVP (AVP Code 291) is of type Unsigned32
   and contains the maximum number of seconds of service to be provided
   to the user before the user is to be re-authenticated and/or re-
   authorized. Great care should be taken when the Authorization-



Calhoun et al.           expires December 2001                 [Page 67]





Internet-Draft                                                 June 2001


   Lifetime value is determined, since a low value could create
   significant Diameter traffic, which could congest both the network
   and the agents.

   If both this AVP and the Session-Timeout AVP are present in a
   message, the value of the latter MUST NOT be smaller than the
   Authorization-Lifetime AVP.

   This AVP MAY be provided by the client as a hint of the maximum
   duration that it is willing to accept. However, the server DOES NOT
   have to observe the hint, and MAY return a value that is smaller than
   the hint. A value of zero means that no re-authorization is required.


10.5  Session-Timeout AVP

   The Session-Timeout AVP (AVP Code 27) [1] is of type Unsigned32 and
   contains the maximum number of seconds of service to be provided to
   the user before termination of the session. A session terminated due
   to the Session-Timeout expiration MUST NOT generate a re-
   authentication and/or re-authorization.

   A value of zero, or the absence of this AVP, means that this session
   has an unlimited number of seconds before termination.

   This AVP MAY be provided by the client as a hint of the maximum
   duration that it is willing to accept. However, the server DOES NOT
   have to observe the hint, and MAY return a value that is smaller than
   the hint.


10.6  User-Name AVP

   The User-Name AVP (AVP Code 1) [1] is of type OctetString, which
   contains the User-Name.  The value is represented as a UTF-8
   character encoded string in a format consistent with the NAI
   specification [8].


10.7  Session Termination

   It is necessary for a Diameter server that authorized a session to be
   notified when that session is no longer active, both for tracking
   purposes as well as to allow stateful agents to release any resources
   that they may have provided for the user's session.

   When a user session that required Diameter authorization terminates,
   the access device that provided the service MUST issue a Session-



Calhoun et al.           expires December 2001                 [Page 68]





Internet-Draft                                                 June 2001


   Termination- Request (STR) message to the Diameter server that
   authorized the service, to notify it that the session is no longer
   active. An STR MUST be issued when a user session terminates for any
   reason, including user logoff, expiration of Session-Timeout,
   administrative action, termination upon receipt of an Abort-Session-
   Request (see below), orderly shutdown of the access device, etc.

   The access device also MUST issue an STR for a session that was
   authorized but never actually started. This could occur, for example,
   due to a sudden resource shortage in the access device, or because
   the access device is unwilling to provide the type of service
   requested in the authorization, or because the access device does not
   support a mandatory AVP returned in the authorization, etc.

   It is also possible that a session that was authorized is never
   actually started due to action of a proxy. For example, a proxy may
   modify an authorization answer, converting the result from success to
   failure, prior to forwarding the message to the access device. A
   proxy that causes an authorized session not to be started MUST issue
   an STR to the Diameter server that authorized the session, since the
   access device has no way of knowing that the session had been
   authorized.

   A Diameter server that receives an STR message MUST clean up
   resources (e.g., session state) associated with the Session-Id
   specified in the STR, and return a Session-Termination-Answer.

   A Diameter server also MUST clean up resources when the Session-
   Timeout expires, or when the Authorization-Lifetime expires without
   re-authorization, regardless of whether an STR for that session is
   received. The access device is not expected to provide service beyond
   the expiration of these timers; thus, expiration of either of these
   timers implies that the access device may have unexpectedly shut
   down.


10.7.1  Session-Termination-Request

   The Session-Termination-Request (STR), indicated by the Command-Code
   set to 275 and the Command Flags' 'R' bit set, is sent by the access
   device to inform the Diameter Server that an authenticated and/or
   authorized session is being terminated.

   Message Format







Calhoun et al.           expires December 2001                 [Page 69]





Internet-Draft                                                 June 2001


      <Session-Termination-Request>  ::= < Diameter Header: 275, REQUEST
      >
                                         < Session-Id >
                                         { Origin-Host }
                                         { Origin-Realm }
                                         { Destination-Realm }
                                         { Destination-Host }
                                         { User-Name }
                                         { Termination-Cause }
                                         [ Origin-State-Id ]
                                       * [ AVP ]
                                       * [ Proxy-Info ]
                                       * [ Route-Record ]


10.7.2  Session-Termination-Answer

   The Session-Termination-Answer (STA), indicated by the Command- Code
   set to 275 and the message flags' 'R' bit clear, is sent by the
   Diameter Server to acknowledge the notification that the session has
   been terminated. The Result-Code AVP MUST be present, and MAY contain
   an indication that an error occurred while servicing the STR.

   Upon sending or receipt of the STA, the Diameter Server MUST release
   all resources for the session indicated by the Session-Id AVP. Any
   intermediate server in the Proxy-Chain MAY also release any
   resources, if necessary.

   Message Format

      <Session-Termination-Answer>  ::= < Diameter Header: 275 >
                                        < Session-Id >
                                        { Result-Code }
                                        { Origin-Host }
                                        { Origin-Realm }
                                        { Destination-Host }
                                        { User-Name }
                                        [ Origin-State-Id ]
                                      * [ AVP ]
                                      * [ Proxy-Info ]
                                      * [ Route-Record ]


10.8  Aborting a Session

   A Diameter server may request that the access device stop providing
   service for a particular session by issuing an Abort-Session-Request
   (ASR).



Calhoun et al.           expires December 2001                 [Page 70]





Internet-Draft                                                 June 2001


   For example, the Diameter server that originally authorized the
   session may be required to cause that session to be stopped for
   credit or other reasons that were not anticipated when the session
   was first authorized. Or, an operator may maintain a management
   server for the purpose of issuing ASRs to administratively remove
   users from the network.

   An access device that receives an ASR with Session-ID equal to a
   currently active session MAY stop the session. Whether the access
   device stops the session or not is implementation- and/or
   configuration- dependent. For example, an access device may honor
   ASRs from certain agents only. In any case, the access device MUST
   respond with an Abort-Session-Answer, including a Result-Code AVP to
   indicate what action it took.

   Note that if the access device does stop the session upon receipt of
   an ASR, it issues an STR to the authorizing server (which may or may
   not be the agent issuing the ASR) just as it would if the session
   were terminated for any other reason.


10.8.1  Abort-Session-Request

   The Abort-Session-Request (ASR), indicated by the Command-Code set to
   274 and the message flags' 'R' bit set, may be sent by any server to
   the access device that is providing session service, to request that
   the session identified by the Session-Id be stopped.

   Message Format

      <Abort-Session-Request>  ::= < Diameter Header: 274, REQUEST >
                                   < Session-Id >
                                   { Origin-Host }
                                   { Origin-Realm }
                                   { Destination-Realm }
                                   { Destination-Host }
                                   [ Origin-State-Id ]
                                 * [ AVP ]
                                 * [ Proxy-Info ]
                                 * [ Route-Record ]


10.8.2  Abort-Session-Answer

   The Abort-Session-Answer (ASA), indicated by the Command-Code set to
   274 and the message flags' 'R' bit clear, is sent in response to the
   ASR. The Result-Code AVP MUST be present, and indicates the
   disposition of the request.



Calhoun et al.           expires December 2001                 [Page 71]





Internet-Draft                                                 June 2001


   If the session identified by Session-Id in the ASR was successfully
   terminated, Result-Code is set to DIAMETER_SUCCESS. If the session is
   not currently active, Result-Code is set to
   DIAMETER_UNKNOWN_SESSION_ID. If the access device does not stop the
   session for any other reason, Result-Code is set to
   DIAMETER_UNABLE_TO_COMPLY.

   Message Format

      <Abort-Session-Answer>  ::= < Diameter Header: 274 >
                                  < Session-Id >
                                  { Result-Code }
                                  { Origin-Host }
                                  { Origin-Realm }
                                  { Destination-Host }
                                  [ Origin-State-Id ]
                                * [ AVP ]
                                * [ Proxy-Info ]
                                * [ Route-Record ]


10.9  Termination-Cause AVP

   The Termination-Cause AVP (AVP Code 295) is of type Unsigned32, and
   is used to indicate the reason why a session was terminated on the
   access device. The following values are defined:

      DIAMETER_LOGOUT                   1
         The user initiated a disconnect

      DIAMETER_SERVICE_NOT_PROVIDED     2
         This value is used when the user disconnected prior to the
         receipt of the authorization answer message.

      DIAMETER_BAD_ANSWER               3
         This value indicates that the authorization answer received by
         the access device was not processed successfully.

      DIAMETER_ADMINISTRATIVE           4
         The user was not granted access, or was disconnected, due to
         administrative reasons, such as the receipt of a Session-Kill-
         Request message.

      DIAMETER_LINK_BROKEN              5
         The communication to the user was abruptly disconnected.


10.10 Inferring Session Termination from Origin-State-Id



Calhoun et al.           expires December 2001                 [Page 72]





Internet-Draft                                                 June 2001


   Origin-State-Id is used to allow rapid detection of terminated
   sessions for which no STR would have been issued, due to
   unanticipated shutdown of an access device.

   By including Origin-State-Id in CER/CAA messages, an access device
   allows a next-hop server to determine immediately upon connection
   whether the device has lost its sessions since the last connection.

   By including Origin-State-Id in request messages, an access device
   also allows a server with which it communicates via proxy to make
   such a determination. However, a server that is not directly
   connected with the access device will not discover that the access
   device has been restarted unless and until it receives a new request
   from the access device. Thus, use of this mechanism across proxies is
   opportunistic rather than reliable, but useful nonetheless.

   When a Diameter server receives a Origin-State-Id that is greater
   than the Origin-State-Id previously received from the same issuer, it
   may assume that the issuer has lost state since the previous message
   and that all sessions that were active under the lower Origin-State-
   Id have been terminated. The Diameter server MAY clean up all session
   state associated with such lost sessions, and MAY also issues STRs
   for all such lost sessions that were authorized on downstream
   servers, to allow session state to be cleaned up globally.


10.11  Origin-State-Id AVP

   The Origin-State-Id AVP (AVP Code 278), of type Unsigned32, is a
   monotonically increasing value that is advanced whenever a Diameter
   entity restarts with loss of previous state, for example upon reboot.
   Origin-State-Id MAY be included in any Diameter message, including
   CER.

   A Diameter entity issuing this AVP MUST create a higher value for
   this AVP each time its state is reset. A Diameter entity MAY set
   Origin-State-Id to the time of startup, or it MAY use an incrementing
   counter retained in non-volatile memory across restarts.

   The Origin-State-Id, if present, MUST reflect the state of the entity
   indicated by Origin-Host. If a proxy modifies Origin-Host, it MUST
   either remove Origin-State-Id or modify it appropriately as well.

   Typically, Origin-State-Id is used by an access device that always
   starts up with no active sessions; that is, any session active prior
   to restart will have been been lost. By including Origin-State-Id in
   a message, it allows other Diameter entities to infer that sessions
   associated with a lower Origin-State-Id are no longer active. If an



Calhoun et al.           expires December 2001                 [Page 73]





Internet-Draft                                                 June 2001


   access device does not intend for such inferences to be made, it MUST
   either not include Origin-State-Id in any message, or set its value
   to 0.


11.0  Accounting

   This accounting protocol is based on a server directed model with
   capabilities for real-time delivery of accounting information.
   Several fault resilience methods [40] have been built in to the
   protocol in order minimize loss of accounting data in various fault
   situations and under different assumptions about the capabilities of
   the used devices.


11.1  Server Directed Model

   The server directed model means that the device generating the
   accounting data gets information from either the authorization server
   (if contacted) or the accounting server regarding the way accounting
   data shall be forwarded.  This information includes accounting record
   timeliness requirements.

   As discussed in [40], real-time transfer of accounting records is a
   requirement, such as the need to perform credit limit checks and
   fraud detection. Note that batch accounting is not a requirement, and
   is therefore not supported by Diameter. Should Batched Accounting be
   required in the future, a new Diameter application will need to be
   created, or it could be handled using another protocol.

   The authorization server (chain) directs the selection of proper
   transfer strategy, based on its knowledge of the user and
   relationships of roaming partnerships. The server (or agents) uses
   the Accounting-Interim-Interval AVP to control the operation of the
   Diameter peer operating as a client. The Accounting-Interim-Interval
   AVP, when present, instructs the Diameter node acting as a client to
   produce accounting records continuously even during a session.

   The Diameter accounting server MAY override the interim interval by
   including an Accounting-Interim-Interval AVP in the Accounting-Answer
   message. When the AVP is present, the latest value received SHOULD be
   used in the generation of interim accounting messages.


11.2  Protocol Messages

   A Diameter node that receives a successful authentication and/or
   authorization messages from the Home AAA Server, MUST collect



Calhoun et al.           expires December 2001                 [Page 74]





Internet-Draft                                                 June 2001


   accounting information for the session. The Accounting-Request
   message is used to transmit the accounting information to the Home
   AAA server, which MUST reply with the Accounting-Answer message to
   confirm reception.  The Accounting-Answer message includes the
   Result-Code AVP, which MAY indicate that an error was present in the
   accounting message.  A rejected Accounting-Request message SHOULD
   cause the user's session to be terminated.

   Each Diameter Accounting protocol message MAY be compressed using
   IPComp [41] in order to reduce the used network bandwidth, which MAY
   use IKE [15] to negotiate the compression parameters.


11.3  Application document requirements

   Each Diameter application (e.g. NASREQ, MobileIP), MUST define their
   Service-Specific AVPs that MUST be present in the Accounting-Request
   message in a section entitled "Accounting AVPs". The application MUST
   assume that the AVPs described in this document will be present in
   all Accounting messages, so only their respective service-specific
   AVPs need to be defined in this section.


11.4  Fault Resilience

   Diameter Base protocol mechanisms are used to overcome small message
   loss and network faults of temporary nature.

   Diameter peers acting as clients MUST implement the use of failover
   to guard against server failures and certain network failures.
   Diameter peers acting as agents or related off-line processing
   systems MUST detect duplicate accounting records caused by the
   sending of same record to several servers and duplication of messages
   in transit. This detection MUST be based on the inspection of the
   Session-Id and Accounting-Record-Number AVP pairs.

   Diameter clients MAY have non-volatile memory for the safe storage of
   accounting records over reboots or extended network failures, network
   partitions, and server failures.  If such memory is available the
   client SHOULD store new accounting records there as soon as the
   records are created and until a positive acknowledgement of their
   reception from the Diameter Server has been received. Upon a reboot,
   the client MUST starting sending the records in the non-volatile
   memory to the accounting server with appropriate modifications in
   termination cause, session length, and other relevant information in
   the records.

   A further application of this protocol may include AVPs to control



Calhoun et al.           expires December 2001                 [Page 75]





Internet-Draft                                                 June 2001


   how many accounting records may at most be stored in the Diameter
   client without committing them to the non-volatile memory or
   transferring them to the Diameter server.

   The client SHOULD NOT remove the accounting data from any of its
   memory areas before the correct Accounting-Answer has been received.
   The client MAY remove oldest, undelivered or yet unacknowledged
   accounting data if it runs out of resources such as memory. It is an
   implementation dependent matter for the client to accept new sessions
   under this condition.


11.5  Accounting Records

   In all accounting records the Session-Id and User-Name AVPs MUST be
   present. If end-to-end authentication is required, as described in
   [11], the CMS-Data AVP may be used to authenticate the Accounting
   Data and Service Specific AVPs. It is not typically necessary, nor
   recommended, that the end-to-end authentication cover any additional
   AVPs since the Data and Service Specific AVP, and associated CMS-
   Data, MAY need to be submitted to a third party.

   Different types of accounting records are sent depending on the
   actual type of accounted service and the authorization server's
   directions for interim accounting. If the accounted service is a
   one-time event, meaning that the start and stop of the event are
   simultaneous, then the Accounting-Record-Type AVP MUST be present and
   set to the value EVENT_RECORD.

   If the accounted service is of a measurable length, then the AVP MUST
   use the values START_RECORD, STOP_RECORD, and possibly,
   INTERIM_RECORD.  If the authorization server has directed interim
   accounting to be enabled for the session, but no interim interval was
   specified, two accounting records MUST be generated for each service
   of type session.  When the initial Accounting-Request is sent for a
   given session is sent, the Accounting-Record-Type AVP MUST be set to
   the value START_RECORD. When the last Accounting-Request is sent, the
   value MUST be STOP_RECORD.

   If a specified interim interval exists, the Diameter client MUST
   produce additional records between the START_RECORD and STOP_RECORD,
   marked INTERIM_RECORD. The production of these records is directed
   both by Accounting-Interim-Interval as well as any re-authentication
   or re-authorization of the session.  The Diameter client MUST
   overwrite any previous interim accounting records that are locally
   stored for delivery, if a new record is being generated for the same
   session. This ensures that only one pending interim record can exist
   on an access device for any given session.



Calhoun et al.           expires December 2001                 [Page 76]





Internet-Draft                                                 June 2001


   A particular value of Accounting-Session-Id MUST appear only in one
   sequence of accounting records from a DIAMETER client, except for the
   purposes of retransmission. Note that sometimes such sequence of
   records is related to a higher-level session, possibly spanning
   several DIAMETER clients. The linking of such record sequences
   together lies, however, outside DIAMETER and is typically performed
   by postprocessing systems. It is the responsibility of the particular
   Diameter application specification to define a sufficient set of AVPs
   so that this correlation can be done based on, for instance, IP
   addresses. Likewise, the application specifications MUST also define
   the exact concept of a session that is being accounted.  For
   instance, the NASREQ DIAMETER application treats a single PPP
   connection to a Network Access Server as one session.

   The one sequence that is sent MUST be either one record with
   Accounting-Record-Type AVP set to the value EVENT_RECORD, or several
   records starting with one having the value START_RECORD, followed by
   zero or more INTERIM_RECORD, and a single STOP_RECORD. That is, it is
   not allowed to mix record types, such as sending interim records
   followed by an event record. A particular Diameter application
   specification MUST define which kind of sequences should be used.


12.0  Accounting Command-Codes

   This section defines new Command-Code  values that MUST be supported
   by all Diameter implementations that provide Accounting services.


12.1  Accounting-Request

   The Accounting-Request command, indicated by the Command-Code field
   set to 271 and the Command Flags' 'R' bit set, is sent by a Diameter
   node, acting as a client, in order to exchange accounting information
   with a peer.

   When the Accounting-Request is being submitted to a third party (e.g.
   settlement service), and includes the CMS-Data AVP [11], the CMS-Data
   AVP MUST be signed by both the local and home Diameter server using
   the countersignature procedures described in [11].

   The AVP listed below SHOULD include service specific accounting AVPs,
   as described in section 11.3.








Calhoun et al.           expires December 2001                 [Page 77]





Internet-Draft                                                 June 2001


   Message Format

      <Accounting-Request> ::= < Diameter Header: 271, REQUEST >
                               < Session-Id >
                               { Acct-Application-Id }
                               { User-Name }
                               { Origin-Host }
                               { Origin-Realm }
                               { Destination-Realm }
                               { Accounting-Record-Type }
                               { Accounting-Record-Number }
                               { Accounting-Session-Id }
                               [ Accounting-Interim-Interval ]
                               [ Origin-State-Id ]
                             * [ AVP ]
                             * [ Proxy-Info ]
                             * [ Route-Record ]


12.2  Accounting-Answer

   The Accounting-Answer command, indicated by the Command-Code field
   set to 271 and the Command Flags' 'R' bit cleared, is used to
   acknowledge an Accounting-Request command. The Accounting-Answer
   command contains the same Session-Id and MAY contains the same
   Accounting Description and Usage AVPs that were sent in the
   Accounting-Request command. If the CMS-Data AVP was present in the
   Accounting-Request, the corresponding ACA message MUST include the
   CMS-Data AVP signed by the responder to provide strong AVP
   authentication, which MAY be used for the purposes of repudiation.

   Only the target Diameter Server, known as the home Diameter Server,
   SHOULD respond with the Accounting-Answer command.

   The AVP listed below SHOULD include service specific accounting AVPs,
   as described in section 11.3.















Calhoun et al.           expires December 2001                 [Page 78]





Internet-Draft                                                 June 2001


   Message Format

      <Accounting-Answer> ::= < Diameter Header: 271, A >
                              < Session-Id >
                              { Acct-Application-Id }
                              { User-Name }
                              { Result-Code }
                              { Origin-Host }
                              { Origin-Realm }
                              { Destination-Host }
                              { Accounting-Record-Type }
                              { Accounting-Record-Number }
                              { Accounting-Session-Id }
                              [ Error-Reporting-Host ]
                              [ Accounting-Interim-Interval ]
                              [ Origin-State-Id ]
                            * [ AVP ]
                            * [ Proxy-Info ]
                            * [ Route-Record ]


12.3  Accounting-Poll-Ind

   The Accounting-Poll-Ind command, indicated by the Command-Code field
   set to 273 and the message flags' 'I' bit set, is sent by a Diameter
   Server in order to force the peer to send current accounting data.
   This data MUST include not yet sent accounting records from completed
   sessions, as well as INTERIM_RECORD records from all ongoing
   sessions.

   A Failed API would contain the same Command-Code, but would require
   that only be 'F' bit be set.

   Diameter implementations MAY support the Accounting-Poll-Ind command.
   An implementation still conforms to this specification if API is not
   supported.

   The receiver MUST use the Accounting-Request command to send the
   accounting data.

   The use of Accounting-Poll-Ind is useful in situations where a
   Diameter server comes up after an unscheduled downtime, and wishes to
   synchronize with the client(s) sooner than at the end of the next
   INTERIM_RECORD or at the end of a session.

   Warning: The use of the Accounting-Poll-Ind message is discouraged in
   roaming networks, since it is unfeasible for a server to attempt to
   poll all of it's roaming partner's Diameter peers.



Calhoun et al.           expires December 2001                 [Page 79]





Internet-Draft                                                 June 2001


   Message Format

      <Accounting-Poll-Ind> ::= < Diameter Header: 273, I >
                                < Session-Id >
                                { Acct-Application-Id }
                                { Destination-Host }
                                { Origin-Host }
                                { Origin-Realm }
                                { Destination-Realm }
                                { Accounting-Session-Id }
                                [ Origin-State-Id ]
                              * [ AVP ]
                              * [ Proxy-Info ]
                              * [ Route-Record ]


13.0 Accounting AVPs

   This section contains AVPs that describe accounting usage information
   related to a specific session.


13.1  Accounting-Record-Type AVP

   The Accounting-Record-Type AVP (AVP Code 480) is of type Unsigned32
   and contains the type of accounting record being sent. The following
   values are currently defined for the Accounting-Record-Type AVP:

      EVENT_RECORD                    1
         An Accounting Event Record is used to indicate that a one-time
         event has occurred (meaning that the start and end of the event
         are simultaneous).  This record contains all information
         relevant to the service, and is the only record of the service.

      START_RECORD                    2
         An Accounting Start, Interim, and Stop Records are used to
         indicate that a service of a measurable length has been given.
         An Accounting Start Record is used to initiate an accounting
         session, and contains accounting information that is relevant
         to the initiation of the session.

      INTERIM_RECORD                  3
         An Interim Accounting Record contains cumulative accounting
         information for an existing accounting session. Interim
         Accounting Records SHOULD be sent every time a re-
         authentication or re-authorization occurs.  Further, additional
         interim record triggers MAY be defined by application-specific
         Diameter applications. The selection of whether to use



Calhoun et al.           expires December 2001                 [Page 80]





Internet-Draft                                                 June 2001


         INTERIM_RECORD records is directed by the Accounting-Interim-
         Interval AVP.

      STOP_RECORD                     4
         An Accounting Stop Record is sent to terminate an accounting
         session and contains cumulative accounting information relevant
         to the existing session.


13.2  Accounting-Interim-Interval AVP

   The Accounting-Interim-Interval AVP (AVP Code 482) is of type
   Unsigned32 and is sent from the Diameter home authorization server to
   the Diameter client. The client uses information in this AVP to
   decide how and when to produce accounting records. With different
   values in this AVP, service sessions can result in one, two, or two+N
   accounting records, based on the needs of the home-organization. The
   following accounting record production behavior is directed by the
   inclusion of this AVP:

      1. The omission of the Accounting-Interim-Interval AVP or its
         inclusion with Value field set to 0 means that EVENT_RECORD,
         START_RECORD, and STOP_RECORD are produced, as appropriate for
         the service.

      2. The inclusion of the AVP with Value field set to a non-zero
         value means that INTERIM_RECORD records MUST be produced
         between the START_RECORD and STOP_RECORD records.  The Value
         field of this AVP is the nominal interval between these records
         in seconds. The Diameter node that originates the accounting
         information, known as the client, MUST produce the first
         INTERIM_RECORD record roughly at the time when this nominal
         interval has elapsed from the START_RECORD, the next one again
         as the interval has elapsed once more, and so on until the
         session ends and a STOP_RECORD record is produced.

         The client MUST ensure that the interim record production times
         are randomized so that large accounting message storms are not
         created either among records or around a common service start
         time.


13.3  Accounting-Record-Number AVP

   The Accounting-Record-Number AVP (AVP Code 485) is of type Unsigned32
   and identifies this record within one session. As Session-Id AVPs are
   globally unique, the combination of Session-Id and Accounting-
   Record-Number AVPs is also globally unique, and can be used in



Calhoun et al.           expires December 2001                 [Page 81]





Internet-Draft                                                 June 2001


   matching accounting records with confirmations.  An easy way to
   produce unique numbers is to set the value to 0 for records of type
   EVENT_RECORD and START_RECORD, and set the value to 1 for the first
   INTERIM_RECORD, 2 for the second, and so on until the value for
   STOP_RECORD is one more than for the last INTERIM_RECORD.


13.4  Accounting-Session-Id AVP

   The Accounting-Session-Id AVP (AVP Code 44) is of type OctetString,
   and SHOULD be encoded in UTF-8 format [13], following the format
   specified in section 10.3. The Accounting-Session-Id is not used by
   the Diameter protocol, since the Session-Id defined in [1] is used
   for both authentication/authorization and accounting purposes.
   However, a RADIUS/Diameter gateway MAY need to include the
   Accounting-Session-Id in Diameter accounting messages.


13.5  Accounting-Multi-Session-Id AVP

   The Accounting-Multi-Session-Id AVP (AVP Code 50) is of type
   OctetString and SHOULD be encoded in UTF08 format [13], following the
   format specified in section 10.3. The Accounting-Multi-Session-Id AVP
   is used to link together multiple related accounting sessions, where
   each session would have a unique Accounting-Session-Id, but the same
   Acounting-Multi-Session-Id AVP. This AVP MAY be returned by the
   Diameter server in an authorization answer, and MUST be used in all
   accounting messages for the given session.


14.0  AVP Occurrence Table

   The following tables presents the AVPs defined in this document, and
   specifies in which Diameter messages they MAY, or MAY NOT be present.
   Note that AVPs that can only be present within a Grouped AVP are not
   represented in this table.

   The table uses the following symbols:
      0      The AVP MUST NOT be present in the message.
      0+     Zero or more instances of the AVP MAY be present in the
            message.
      0-1    Zero or one instance of the AVP MAY be present in the
            message. It is considered an error if there are more than
            once instance of the AVP.
      1     One instance of the AVP MUST be present in the message.
      1+    At least one instance of the AVP MUST be present in the
            message.




Calhoun et al.           expires December 2001                 [Page 82]





Internet-Draft                                                 June 2001


14.1  Base Protocol Command AVP Table

   The table in this section is limited to the non-accounting Command
   Codes defined in this specification.
                                 +-----------------------------------+
                                 |            Command-Code           |
                                 |---+---+---+---+---+---+---+---+---+
   Attribute Name                |CER|CEA|MRA|DWR|DWA|ASR|ASA|STR|STA|
   ------------------------------|---+---+---+---+---+---+---+---+---|
   Acct-Application-Id           |0+ |0+ |0  |0  |0  |0  |0  |0  |0  |
   Auth-Application-Id           |0+ |0+ |0  |0  |0  |0  |0  |0  |0  |
   Authorization-Lifetime        |0  |0  |0  |0  |0  |0  |0  |0  |0  |
   Destination-Host              |0-1|0-1|1  |0-1|1  |1  |1  |0-1|1  |
   Destination-Realm             |0  |0  |0  |0  |0  |1  |0  |1  |0  |
   Error-Message                 |0  |0  |0  |0  |0  |0  |0-1|0  |0  |
   Error-Reporting-Host          |0  |0  |0  |0  |0  |0  |0-1|0  |0  |
   Failed-AVP                    |0  |0+ |0+ |0  |0+ |0  |0+ |0  |0+ |
   Firmware-Revision             |0-1|0-1|0  |0  |0  |0  |0  |0  |0  |
   Host-IP-Address               |1+ |1+ |0  |0  |0  |0  |0  |0  |0  |
   Origin-Host                   |1  |1  |1  |1  |1  |1  |1  |1  |1  |
   Origin-Realm                  |1  |1  |1  |1  |1  |1  |1  |1  |1  |
   Product-Name                  |1  |1  |0  |0  |0  |0  |0  |0  |0  |
   Proxy-Info                    |0  |0  |0  |0  |0  |0+ |0+ |0+ |0+ |
   Redirect-Host                 |0  |0  |0  |0  |0  |0  |0  |0  |0  |
   Result-Code                   |0  |1  |1  |0  |1  |0  |0  |0  |1  |
   Route-Record                  |0  |0  |0  |0  |0  |0+ |0+ |0+ |0+ |
   Session-Id                    |0  |0  |1  |0  |0  |1  |1  |1  |1  |
   Session-Timeout               |0  |0  |0  |0  |0  |0  |0  |0  |0  |
   Origin-State-Id               |0-1|0-1|0-1|0-1|0-1|0-1|0-1|0-1|0-1|
   Supported-Vendor-Id           |0+ |0  |0  |0  |0  |0  |0  |0  |0  |
   Termination-Cause             |0  |0  |0  |0  |0  |0  |0  |1  |0  |
   User-Name                     |0  |0  |0  |0  |0  |1  |1  |1  |1  |
   Vendor-Id                     |1  |1  |0  |0  |0  |0  |0  |0  |0  |
   Vendor-Specific-Application-Id|0+ |0+ |0  |0  |0  |0  |0  |0  |0  |
   ------------------------------|---+---+---+---+---+---+---+---+---|


14.2  Accounting AVP Table

   The table in this section is used to represent which AVPs defined in
   this document are to be present in the Accounting messages.










Calhoun et al.           expires December 2001                 [Page 83]





Internet-Draft                                                 June 2001


                                 +-----------------+
                                 |   Command-Code  |
                                 |-----+-----+-----+
   Attribute Name                | ACR | ACA | API |
   ------------------------------|-----+-----+-----+
   Accounting-Interim-Interval   | 0-1 | 0-1 | 0   |
   Accounting-Multi-Session-Id   | 0-1 | 0-1 | 0   |
   Accounting-Record-Number      | 1   | 1   | 0   |
   Accounting-Record-Type        | 1   | 1   | 0   |
   Accounting-Session-Id         | 1   | 1   | 1   |
   Acct-Application-Id           | 1   | 1   | 1   |
   Destination-Host              | 0+  | 1   | 0-1 |
   Destination-Realm             | 1   | 0   | 1   |
   Error-Reporting-Host          | 0   | 0+  | 0   |
   Max-Time-Wait                 | 0+  | 0   | 0   |
   Origin-Host                   | 1   | 1   | 1   |
   Origin-Realm                  | 1   | 1   | 1   |
   Proxy-Info                    | 0+  | 0+  | 0   |
   Route-Record                  | 0+  | 0+  | 0+  |
   Result-Code                   | 0   | 1   | 0   |
   Session-Id                    | 1   | 1   | 1   |
   ------------------------------|-----+-----+-----+


15.0  IANA Considerations

   This document defines a number of assigned numbers to be maintained
   by the IANA.  This section explains the criteria to be used by the
   IANA to assign additional numbers in each of these lists. The
   following subsections describe the assignment policy for the
   namespaces defined elsewhere in this document.


15.1  AVP

   As defined in section 4.0, the AVP header contains two fields that
   requires IANA namespace management; the AVP Code and Flags field.


15.1.1  AVP Code

   the AVP Code namespace is used to identify attributes. When the
   Vendor ID value is set to zero (0), IANA will maintain a registry of
   assigned AVP codes, and in some cases also their values. AVP Codes
   0-254 are managed separately as RADIUS Attribute Types [46], while
   the remaining namespace is available for assignment via Specification
   Required [12].




Calhoun et al.           expires December 2001                 [Page 84]





Internet-Draft                                                 June 2001


   Vendor-Specific AVP Codes, where the Vendor-Id field in the AVP
   header is set to a non-zero value, is for Private Use.

   This document defines the AVP Codes 257-260, 263-269, 278-284, 291-
   297, 480, 482 and 485-486. See section 4.5 for the assignment of the
   namespace in this specification.


15.1.2  AVP Flags

   There are 16 bits in the AVP Flags field of the AVP header, defined
   in section 4.0. This document assigns bit 1 ('M'andatory), bit 3
   ('V'endor Specific) and bit 5 ('P'rotected). The remaining bits
   should only be assigned via a Standards Action [12].


15.2  Diameter Header

   As defined in section 3.0, the Diameter header contains two fields
   that require IANA namespace management; Command Code and Command
   Flags.


15.2.1  Command Codes

   The Command Code namespace is used to identify Diameter commands.
   The values 0-255 are reserved for RADIUS backward compatibility, and
   are defined as "RADIUS Packet Type Codes" in [46]. The remaining
   values are available via Standards Action [12].

   Vendor-Specific Command Codes, where the Vendor-Id field in the
   Diameter header is set to a non-zero value, is for Private Use.

   This document defines the Command Codes 257, 271, 273-275, 280 and
   282.  See section 3.1 for the assignment of the namespace in this
   specification.


15.2.2  Command Flags

   There are eight bits in the Command Flags field of the Diameter
   header. This document assigns bit 8 ('R'equest). Bits 1 through 7
   MUST only be assigned via a Standards Action [12].


15.3  Application Identifiers

   As defined in section 6.1, the Application Identifier is used to



Calhoun et al.           expires December 2001                 [Page 85]





Internet-Draft                                                 June 2001


   identify a specific Diameter Application. All values, other than zero
   (0) are available for assignment via Standards Action [12].

   Note that the Diameter protocol is not intended to be extended for
   any purpose. Any applications defined MUST ensure that they fit
   within the existing framework, and that no changes to the base
   protocol are required.


15.4  Result-Code AVP Values

   As defined in Section 9.1, the Result-Code AVP (AVP Code 268) defines
   the values 1001, 2001, 4001-4003 and 5001-5015.

   All remaining values are available for assignment via IETF Consensus
   [12].


15.5  Accounting-Record-Type AVP Values

   As defined in Section 13.1, the Accounting-Record-Type AVP (AVP Code
   480) defines the values 1-4. All remaining values are available for
   assignment via IETF Consensus [12].


15.6  Termination-Cause AVP Values

   As defined in Section 10.9, the Termination-Cause AVP (AVP Code 295)
   defines the values 1-5. All remaining values are available for
   assignment via IETF Consensus [12].


15.7  Diameter TCP/SCTP Port Numbers

   An IANA request has been placed for TCP and SCTP port numbers. The
   IANA has informed the authors that "TBD" should be used in section
   2.1 this document, and will be updated by the RFC editor during the
   RFC publication process.

   IANA should also replace "TBD" in section 2.7 with the port number
   assigned in section 2.1


16.0  Diameter protocol related configurable parameters

   This section contains the configurable parameters that are found
   throughout this document:




Calhoun et al.           expires December 2001                 [Page 86]





Internet-Draft                                                 June 2001


      Diameter Peer
         A Diameter entity MAY communicate with peers that are
         statically configured. A statically configured Diameter peer
         would require that either the IP address or the fully qualified
         domain name (FQDN) be supplied, which would then be used to
         resolve through DNS.

      Realm Routing Table
         A Diameter Proxy server routes messages based on the realm
         portion of a Network Access Identifier (NAI). The server MUST
         have a table of Realms Names, and the address of the peer to
         which the message must be forwarded to. The routing table MAY
         also include a "default route", which is typically used for all
         messages that cannot be locally processed.

      Tc timer
         The Tc timer controls the frequency that transport connection
         attempts are done to a peer with whom no active transport
         connection exists. The recommended value is 30 seconds.

      Tw timer
         The Tw timer controls the frequency the watchdog messages are
         to be sent to inactive peers. The recommended value is 30
         seconds.


17.0  Security Considerations

   The Diameter base protocol assumes that messages are secured by using
   either IP Security, or TLS. This security model is acceptable in
   environments where there are no untrusted third party relay, proxy,
   or redirect servers.

   When third party brokers or redirect servers are used, strong
   application level security SHOULD be required, such as non-
   repudiation.  When the communicating peers do require this level of
   security either for legal or business purposes, the Diameter
   application defined in [11] MAY be used. This security model provides
   AVP-level authentication, and the encryption mechanism is designed
   such that only the target host has the keying information required to
   decrypt the information.


18.0  References


   [1]  C. Rigney, A. Rubens, W. Simpson, S. Willens, "Remote Authenti-
        cation Dial In User Service (RADIUS)", RFC 2865, June 2000.



Calhoun et al.           expires December 2001                 [Page 87]





Internet-Draft                                                 June 2001


   [2]  Reynolds, Postel, "Assigned Numbers", RFC 1700, October 1994.

   [3]  Postel, "User Datagram Protocol", RFC 768, August 1980.

   [4]  Rivest, "The MD5 Message-Digest Algorithm", RFC 1321, April
        1992.

   [5]  Kaufman, Perlman, Speciner, "Network Security: Private Communi-
        cations in a Public World", Prentice Hall, March 1995, ISBN 0-
        13-061466-1.

   [6]  Krawczyk, Bellare, Canetti, "HMAC: Keyed-Hashing for Message
        Authentication", RFC 2104, January 1997.

   [7]  P. Calhoun, W. Bulley, A. Rubens, J. Haag, "Diameter NASREQ
        Application", draft-ietf-aaa-diameter-nasreq-05.txt, IETF work
        in progress, June 2001.

   [8]  Aboba, Beadles "The Network Access Identifier." RFC 2486. Janu-
        ary 1999.

   [10] P. Calhoun, C. Perkins, "Diameter Mobile IP Application",
        draft-ietf-aaa-diameter-mobileip-05.txt, IETF work in progress,
        June 2001.

   [11] P. Calhoun, W. Bulley, S. Farrell, "Diameter CMS Security appli-
        cation", draft-ietf-aaa-diameter-cms-sec-00.txt (work in pro-
        gress), June 2001.

   [12] Narten, Alvestrand,"Guidelines for Writing an IANA Considera-
        tions Section in RFCs", BCP 26, RFC 2434, October 1998

   [13] S. Bradner, "Key words for use in RFCs to Indicate Requirement
        Levels", BCP 14, RFC 2119, March 1997.

   [14] Myers, Ankney, Malpani, Galperin, Adams, "X.509 Internet Public
        Key Infrastructure Online Certificate Status Protocol (OCSP)",
        RFC 2560, June 1999.

   [15] D. Harkins, D. Carrel, "The Internet Key Exchange (IKE)", RFC
        2409, November 1998.

   [16] Hinden, Deering, "IP Version 6 Addressing Architecture", RFC
        2373, July 1998.

   [17] ISI, "Internet Protocol", RFC 791, September 1981.

   [18] Mills, "Simple Network Time Protocol (SNTP) Version 4 for IPv4,



Calhoun et al.           expires December 2001                 [Page 88]





Internet-Draft                                                 June 2001


        IPv6 and OSI, RFC 2030, October 1996.

   [19] Housley, Ford, Polk, Solo, "Internet X.509 Public Key Infras-
        tructure Certificate and CRL Profile", RFC 2459, January 1999.

   [20] B. Aboba, G. Zorn, "Criteria for Evaluating Roaming Protocols",
        RFC 2477, January 1999.

   [21] M. Beadles, D. Mitton, "Criteria for Evaluating Network Access
        Server Protocols", draft-ietf-nasreq-criteria-05.txt, IETF work
        in progress, June 2000.

   [22] T. Hiller and al, "CDMA2000 Wireless Data Requirements for AAA",
        draft-hiller-cdma2000-aaa-02.txt, IETF work in progress, Sep-
        tember 2000.

   [23] S. Glass, S. Jacobs, C. Perkins, "Mobile IP Authentication,
        Authorization, and Accounting Requirements". RFC 2977. October
        2000.

   [24] F. Yergeau, "UTF-8, a transformation format of ISO 10646", RFC
        2279, January 1998.

   [25] L. J. Blunk, J. R. Vollbrecht, "PPP Extensible Authentication
        Protocol (EAP)." RFC 2284, March 1998.

   [26] R. Stewart et al., "Stream Control Transmission Protocol". RFC
        2960.  October 2000.

   [27] Postel, J. "Transmission Control Protocol", RFC 793, January
        1981.

   [28] E. Guttman, C. Perkins, J. Veizades, M. Day. "Service Location
        Protocol, Version 2", RFC 2165, June 1999.

   [29] T. Berners-Lee, R. Fielding, U.C. Irvine, L. Masinter, "Uniform
        Resource Identifiers (URI): Generic Syntax". RFC 2396, August
        1998.

   [30] Institute of Electrical and Electronics Engineers, "IEEE Stan-
        dard for Binary Floating-Point Arithmetic", ANSI/IEEE Standard
        754-1985, August 1985.

   [31] D. Crocker, P. Overell, "Augmented BNF for Syntax Specifica-
        tions:  ABNF", RFC 2234, November 1997.

   [32] E. Guttman, C. Perkins, J. Kempf, "Service Templates and Ser-
        vice: Schemes", RFC 2609, June 1999.



Calhoun et al.           expires December 2001                 [Page 89]





Internet-Draft                                                 June 2001


   [33] A. Gulbrandsen, P. Vixie, L. Esibov, "A DNS RR for specifying
        the location of services (DNS SRV)", RFC 2782, February 2000.

   [34] D. Eastlake, "Domain Name System Security Extensions", RFC 2535,
        March 1999.

   [35] D. Eastlake, "DNS Security Operational Considerations", RFC
        2541, March 1999.

   [36] D. Eastlake, "DNS Request and Transaction Signatures ( SIG(0)s
        )", RFC 2931, September 2000.

   [37] S. Kent, R. Atkinson, "Security Architecture for the Internet
        Protocol", RFC 2401, November 1998.

   [38] T. Dierks, C. Allen, "The TLS Protocol Version 1.0", RFC 2246,
        January 1999.

   [39] "The Communications of the ACM"  Vol.33, No.6 (June 1990), pp.
        677-680.

   [40] B. Aboba, J. Arkko, D. Harrington. "Introduction to Accounting
        Management", RFC 2975, October 2000.

   [41] A. Shacham, R. Monsour, R. Pereira, M. Thomas, "IP Payload
        Compression Protocol (IPComp)", RFC 2393, December 1998.

   [42] W. Simpson, "The Point-to-Point Protocol (PPP)", RFC 1661, STD
        51, July 1994.

   [43] B. Aboba, J. Lu, J. Alsop, J. Ding, W. Wang, "Review of Roaming
        Implementations", RFC 2194, September 1997.

   [44] B. Aboba, J. Vollbrecht, "Proxy Chaining and Policy Implementa-
        tion in Roaming", RFC 2607, June 1999.

   [45] C. Perkins, Editor.  IP Mobility Support.  RFC 2002, October
        1996.

   [46] IANA, "RADIUS Types", http://www.isi.edu/in-
        notes/iana/assignments/radius-types


19.0  Acknowledgements

   The authors would like to thank Nenad Trifunovic, Tony Johansson and
   Pankaj Patel for their participation in the pre-IETF Document Reading
   Party. Allison Mankin's, Jonathan Wood and Bernard Aboba's assistance



Calhoun et al.           expires December 2001                 [Page 90]





Internet-Draft                                                 June 2001


   was invaluable in working out transport issues, and similarly with
   Steven Bellovin's help in the security area.

   Paul Funk and David Mitton were instrumental in getting the Peer
   State Machine correct, and our deep thanks go to them for their time.
   Text in this document was also provided by Paul Funk, Mark Eklund,
   Mark Jones and Dave Spence.

   The authors would also like to acknowledge the following people for
   their contribution in the development of the Diameter protocol:

   William Bulley, David Frascone, Daniel C. Fox, Lol Grant, Ignacio
   Goyret, Nancy Greene, Peter Heitman, Fredrik Johansson, Mark Jones,
   Martin Julien, Paul Krumviede, Fergal Ladley, Ryan Moats, Victor Mus-
   lin, Kenneth Peirce, Stephen Farrell, Sumit Vakil, John R. Vollbrecht
   and Jeff Weisberg


20.0  Authors' Addresses

   Questions about this memo can be directed to:

      Pat R. Calhoun
      Network and Security Research Center, Sun Laboratories
      Sun Microsystems, Inc.
      15 Network Circle
      Menlo Park, California, 94025
      USA

       Phone:  +1 650-786-7733
         Fax:  +1 650-786-6445
      E-mail:  pcalhoun@eng.sun.com


      Haseeb Akhtar
      Wireless Technology Labs
      Nortel Networks
      2221 Lakeside Blvd.
      Richardson, TX 75082-4399
      USA

       Phone:  +1 972-684-8850
      E-Mail:  haseeb@nortelnetworks.com








Calhoun et al.           expires December 2001                 [Page 91]





Internet-Draft                                                 June 2001


      Jari Arkko
      Oy LM Ericsson Ab
      02420 Jorvas
      Finland

       Phone: +358 40 5079256
      E-Mail: Jari.Arkko@ericsson.com


      Erik Guttman
      Solaris Advanced Development
      Sun Microsystems, Inc.
      Eichhoelzelstr. 7
      74915 Waibstadt
      Germany

       Phone:  +49-7263-911-701
      E-mail:  erik.guttman@germany.sun.com


      Allan C. Rubens
      Tut Systems, Inc.
      220 E. Huron, Suite 260
      Ann Arbor, MI 48104
      USA

       Phone:  +1 734-995-1697
      E-Mail:  arubens@tutsys.com


      Glen Zorn
      Cisco Systems, Inc.
      500 108th Avenue N.E., Suite 500
      Bellevue, WA 98004
      USA

       Phone:  +1 425 438 8218


21.0  Full Copyright Statement

   Copyright (C) The Internet Society (2001).  All Rights Reserved.

   This document and translations of it may be copied and furnished to
   others, and derivative works that comment on or otherwise explain it
   or assist in its implementation may be prepared, copied, published
   and distributed, in whole or in part, without restriction of any
   kind, provided that the above copyright notice and this paragraph are



Calhoun et al.           expires December 2001                 [Page 92]





Internet-Draft                                                 June 2001


   included on all such copies and derivative works. However, this docu-
   ment itself may not be modified in any way, such as by removing the
   copyright notice or references to the Internet Society or other
   Internet organizations, except as needed for the purpose of develop-
   ing Internet standards in which case the procedures for copyrights
   defined in the Internet Standards process must be followed, or as
   required to translate it into languages other than English. The lim-
   ited permissions granted above are perpetual and will not be revoked
   by the Internet Society or its successors or assigns. This document
   and the information contained herein is provided on an "AS IS" basis
   and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK FORCE DIS-
   CLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED
   TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT
   INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR
   FITNESS FOR A PARTICULAR PURPOSE.


22.0  Expiration Date

   This memo is filed as <draft-ietf-aaa-diameter-05.txt> and expires in
   December 2001.






























Calhoun et al.           expires December 2001                 [Page 93]





Internet-Draft                                                 June 2001


Appendix A. Diameter Service Template

   The following service template describes the attributes used by Diam-
   eter servers to advertise themselves.  This simplifies the process of
   selecting an appropriate server to communicate with.  A Diameter
   client can request specific Diameter servers based on characteristics
   of the Diameter service desired (for example, an AAA server to use
   for accounting.)

   Name of submitter:  "Erik Guttman" <Erik.Guttman@sun.com>
   Language of service template:  en


   Security Considerations:
      Diameter clients and servers use various cryptographic mechanisms
      to protect communication integrity, confidentiality as well as
      perform end-point authentication.  It would thus be difficult if
      not impossible for an attacker to advertise itself using SLPv2 and
      pose as a legitimate Diameter peer without proper preconfigured
      secrets or cryptographic keys.  Still, as Diameter services are
      vital for network operation it is important to use SLPv2 authenti-
      cation to prevent an attacker from modifying or eliminating ser-
      vice advertisements for legitimate Diameter servers.

   Template text:
   -------------------------template begins here-----------------------
   template-type=service:diameter

   template-version=0.0

   template-description=
     The Diameter protocol is defined by draft-ietf-aaa-diameter-04.txt

   template-url-syntax=
     url-path= ; The diameter URL format is described in section 2.7.
               ; Example: 'diameter://aaa.example.com:1812;transport=tcp















Calhoun et al.           expires December 2001                 [Page 94]





Internet-Draft                                                 June 2001


      supported-auth-applications= string L M
      # This attribute lists the Diameter applications supported by the
      # AAA implementation.  The applicationss currently defined are:
      #  Application Name     Defined by
      #  ----------------     -----------------------------------
      #  NASREQ               draft-ietf-aaa-diameter-nasreq-04.txt
      #  MobileIP             draft-ietf-aaa-diameter-mobileip-04.txt
      #  CMS Security         draft-ietf-aaa-diameter-cms-sec-00.txt
      #
      # Notes:
      #   . Diameter implementations support one or more applications.
      #   . Additional applications may be defined in the future.
      #     An updated service template will be created at that time.
      #
      NASREQ,MobileIP,CMS Security

      supported-acct-applications= string L M
      # This attribute lists the Diameter applications supported by the
      # AAA implementation.  The applicationss currently defined are:
      #  Application Name     Defined by
      #  ----------------     -----------------------------------
      #  NASREQ               draft-ietf-aaa-diameter-nasreq-04.txt
      #  MobileIP             draft-ietf-aaa-diameter-mobileip-04.txt
      #  CMS Security         draft-ietf-aaa-diameter-cms-sec-00.txt
      #
      # Notes:
      #   . Diameter implementations support one or more applications.
      #   . Additional applications may be defined in the future.
      #     An updated service template will be created at that time.
      #
      NASREQ,MobileIP,CMS Security

      supported-transports= string L M
      SCTP
      # This attribute lists the supported transports that the Diameter
      # implementation accepts.  Note that a compliant Diameter
      # implementation MUST support SCTP, though it MAY support other
      # transports, too.
      SCTP,TCP

   -------------------------template ends here-----------------------










Calhoun et al.           expires December 2001                 [Page 95]


